[
    {
        "companyLocation": "Milwaukee, WI 53226+2 locations",
        "companyName": "My Choice Wisconsin",
        "details": "POSITION TITLE: Application DeveloperPOSITION STATUS: Full-Time, ExemptOFFICE LOCATION: Wauwatosa, WIBENEFITS: MedicalDental +VisionShort-Term + Long-Term Disability401KPaid Time Off + Holiday PayTuition ReimbursementOngoing Professional DevelopmentSUMMARY: The Applications Developer is responsible for building software to be used throughout the organization including the front-end and back-end architecture, development, and maintenance of client-server applications and SQL-based jobs and packages.ESSENTIAL DUTIES AND RESPONSIBILITIES: Build and design the front-end of from layout to function to meet our organizational business needs while striving to create visually appealing sites that feature user-friendly design and clear navigationDevelop and manage well-functioning databases and applications which include development of reusable code and librariesTest software to ensure responsiveness and efficiencyTroubleshoot, debug and upgrade softwareDesign, build, test and maintain data packages that feed business systems and applicationsWrite technical documentationAnalyze software and code for best practices and improvementsEDUCATION AND EXPERIENCE: Minimum of an Associate’s Degree, preferred, in a relevant disciplineThree or more years of experience as a full stack developerKNOWLEDGE AND SKILLS: Proven experience as a Full Stack Developer or similar roleExperience developing .Net desktop and web applicationsPrior experience with .Net tools, full development lifecycle and DevOps toolsExcellent SQL or similar database experienceGreat attention to detail and organizational skillsAbility to manage time focused on delivery timelines and deadlines.Functional experience in establishing and maintaining appropriate security and standard business development methodologies.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceHealth insuranceHealth savings accountLife insurancePaid time offVision insuranceSchedule:Day shiftMonday to FridayAbility to commute/relocate:Milwaukee, WI 53226: Reliably commute or planning to relocate before starting work (Preferred)Education:Associate (Preferred)Experience:Full-stack development: 3 years (Preferred).NET: 1 year (Preferred)Work Location: One location",
        "title": "newApplication Developer",
        "url": "https://www.indeed.com/viewjob?jk=190b3c718e436a5f"
    },
    {
        "companyLocation": "Augusta, GA+9 locations•Remote",
        "companyName": "Rural Sourcing Inc",
        "details": "Web Developer – Rural SourcingRural Sourcing is a software development firm passionate about creating jobs across the United States and changing the IT outsourcing experience for our Fortune 1000 and mid-sized clients. We are committed to being an inclusive workplace, maintaining a culture of equitable, diverse employment and advancement company-wide.Why you will enjoy Mondays again: Opportunity to collaborate with a diverse group of colleagues in a fun, creative environmentProgressive career journey and opportunity for advancementContinuous development through training and mentorship programsExposure to modern technologies across various industries in an agile environmentOpportunity to give back in your local communityCompetitive salary + bonus opportunitiesRobust benefits package, 401(k) plan, and substantial PTOTuition reimbursementA Day in the Life: The Web Developer will build scalable, predictable, high-quality and high-performing web applications.Build new systems using JavaScript and other related technologies such as HTML, CSS, AngularJS, Angular 2+, and ReactDevelop new functionality on existing software productsDesign, code, and test business systems to meet client requirementsResponsible for successful completion of code deliverables within projectsInvolved in the various phases of the SDLCWhat it takes: Hunger for continuous learning and professional developmentProblem solving skills to tackle business challengesIntellectual curiosity to provide creative solutionsAbility to work in a team environmentGood interpersonal, written and verbal communication skillsEqual Employment Opportunity Policy: Rural Sourcing is proud to offer equal employment opportunity without regard to age, color, disability, gender, gender identity, genetic information, marital status, military status, national origin, race, religion, sexual orientation, veteran status, or any other legally protected characteristic.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible scheduleFlexible spending accountHealth insuranceLife insurancePaid time offParental leaveProfessional development assistanceReferral programRetirement planTuition reimbursementVision insuranceSchedule:8 hour shiftSupplemental Pay:Bonus payWork Location: Remote",
        "title": "newWeb Developer",
        "url": "https://www.indeed.com/viewjob?jk=f5ad6948dcc85bbb"
    },
    {
        "companyLocation": "Oregon•Remote",
        "companyName": "DelMain Analytics",
        "details": "Delmain is a full-service digital marketing and web design agency. Our focus is on helping dentists get more patients through their websites.*We’re looking to add a Web Designer/Developer to our growing team.**Our ideal candidate is someone who wants to continue their web design career, stay up-to-date with best practices and emerging trends, and translate client goals into visually stunning websites. This person will be a creative designer, problem solver, and collaborative member of our team.**Take ownership of 2-5 web design projects per month from conception to completionPitch work to clients, answer questions, and incorporate feedbackThink creatively and strategically about the end-to-end user experienceCreate and build wireframes to communicate design ideas to new/existing partners and internal teamsLead occasional branding projectsPerform user research and testing****Delmain is…**Focused on providing digital marketing & web design services to US-based dentists.Currently, a remote company based in Oregon. We have transitioned to remote work and do not (and do not expect to) work in a physical office environment for the foreseeable future.Run using the Entrepreneurial Operating System (EOS). If you’ve worked in an EOS company before, tell us about your experience in your cover letter! If you haven’t, we’ll teach you everything you need to know. EOS is built around 6 components: People, Vision, Data, Issues, Process, and Traction, and requires strong leadership and individual accountability.****Duties & responsibilities35% - Actively contribute to Delmain’s Design & Development Team. Includes daily collaboration, weekly and monthly meetings25% - Simultaneous design, development, and launch of 2-5 websites per month. This position requires significant design work in addition to project management20% - Envision and create usable, unique wireframes and ready-for-production designs based on your interpretation of the website requirements10% - Take ownership of other tasks/projects, including design strategy for all Delmain partners, branding projects, and working with outside web developers5% - Create and document processes, best practices, and standard operating procedures5% - Contribute to improving our internal quality assurance process for web design projects****Formal qualifications**2+ years professional design experience, ideally in an agency settingExperience in Figma or similar design toolIn-depth knowledge of HTML, CSS, and JS/JQuery, and WordPress — we use the Divi theme and if you have experience using it, let us know!Experience in PHP is a plus. If you have experience in developing themes or plugins, let us know!Proficiency in using cPanel and editing DNS records for hosting set up and site launchesComfortable using other CMS platforms like Squarespace and WeeblyExperience leading meetings, communicating ideas to and interfacing with partnersMastery of the Adobe Creative Suite for web design (Photoshop, Illustrator, Indesign, Acrobat)Excellent organizational and project management abilitiesAbility to work in a supportive environment with little supervision while tackling several projects simultaneouslyResidence in Oregon is required**The formalities**Hours: Full-time / SalariedPaid Time OffHealth & Dental InsuranceRetirement PlanRemote Work Stipend****Working at Delmain**We take our core values seriously — they aren’t just things we say, they guide how we make decisions, interact with each other, plan our workdays, and choose the partners we work withWe balance our workload with a team-wide effort to work no more than 40 hours per weekEvery other month, we work a half-day and then enjoy a team outing. Recently, we’ve played virtual bingo together, had trivia quizzes, and went to a pumpkin patch.****Diversity & inclusionJoin us on our journey**“Diversity is counting numbers. Inclusivity is making numbers count.” - Nichole Barnes Marshall**At Delmain, we recognize we need to work on both.**We ask thoughtful questions. We learn together. We strive to be a place where every voice is heard and represented. As we grow our culture and our team, we seek to represent diverse beliefs, backgrounds, education, and skills.****How to apply**Please send a resume and cover letter to careers at delmain.co. In your cover letter briefly tell us how you align with our core values:**Curiosity – We are open to the possibility that there is a better way to do thingsNeighborly – We share in mutual communication, respect, and trustBalanced – We maintain a healthy work-life balance in all of our relationshipsPositivity – We see the best in everyone and every opportunity*Job Type: Full-timePay: $14.00 - $41.00 per hourBenefits:Dental insuranceHealth insuranceRetirement planSchedule:Monday to FridayCOVID-19 considerations:We are a remote company.Work Location: Multiple Locations",
        "title": "Web Designer/Developer",
        "url": "https://www.indeed.com/viewjob?jk=7d839a7edc765f1a"
    },
    {
        "companyLocation": "San Francisco Bay Area, CA+1 location",
        "companyName": "Underdog.io",
        "details": "We're looking for a Frontend Developer to join a company in the Underdog.io network.The Underdog.io network is a curated group of some of the fastest growing startups and tech companies in the country. We actively turn away more than 50% of companies that attempt to join.We accept companies that offer competitive salaries, benefits, and perks. They're working on interesting technical challenges and must be respectful of your time to stay active.Our companies look for Frontend Developers proficient in HTML, CSS, JavaScript, and more. The ideal candidate is passionate about building UIs that solve complex problems and are delightful to use. Many of our companies are looking for mid-to-senior level talent, both individual contributors and managers.To apply to the network, we'll ask you to fill out a 60-second web form. It's absolutely free.If accepted, you'll hear directly from founders, hiring managers, and other key decision makers starting the following Monday. Our platform will hide your profile from your current employer.Apply today!Building an inclusive and diverse workplace is one of Underdog.io’s core values. We warmly welcome people of all backgrounds, experiences, and perspectives.Job Type: Full-timePay: $88,000.00 - $192,000.00 per yearBenefits:Health insurancePaid time offSchedule:8 hour shiftWork Location:One locationWork Remotely:No",
        "title": "Front End Developer",
        "url": "https://www.indeed.com/viewjob?jk=fd0c3bbe00674e2a"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Peklava LLC",
        "details": "As a member of a very small but established and successful team, you'll play an important role growing the scale of our company. We are looking for a candidate with the technological knowledge to design, build, and maintain websites for our new brands. In order to be successful in this role, you will need a thorough understanding of Linux, PHP, JavaScript, HTML, CSS, WordPress, and other related web development platforms and frameworks.Your mission is to build. We move fast and break things and iterate constantly to evolve towards optimal performance.You will design, build and maintain multiple web properties focused on helping consumers compare personal financial products and make informed decisions. Our largest brand is www.ratezip.com where tens of thousands of visitors go to compare mortgage programs and other financial products.Why Us?For this to be the right fit, you must want to work on a very small team. You will work directly with the company founder, developer, and content editor. There are no politics, and no bureaucracy, just direct action and results. You will be evaluated and compensated based on your results, which are measurable.You can work remotely or in our office, the choice is yours.We will offer a competitive base salary.We offer a 401k and employer contributed health coverage.Job Type: Full-timePay: From $100,000.00 per yearBenefits:401(k)Paid time offSchedule:8 hour shiftMonday to FridayOn callEducation:Bachelor's (Preferred)Experience:Front-end development: 1 year (Preferred)CSS: 1 year (Preferred)Work Location: Remote",
        "title": "newFull Stack Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=29155a10299fdba5"
    },
    {
        "companyLocation": "United States",
        "companyName": "Vinformatix",
        "details": "We're looking for a talented and creative Front End Developer with a keen eye for detail to join our team. The ideal candidate will be able to work independently as well as in conjunction with the development, design and testing teams, and must have experience with responsive web design. This is an excellent opportunity to work on a cutting-edge team within an exciting organization, and the successful candidate must be able to meet deadlines while being flexible with changing priorities.Responsibilities:Create user-friendly interfaces for end users.Create new features for a web application.Design a new user interface using HTML, CSS, and JavaScript.Be familiar with commonly used coding languages such as HTML, CSS, and PHP.Understand relational databases and work with them.Be familiar with the tools used for client-side debugging.Develop new features for a web product.Be familiar with development tools such as Sublime Text, Notepad++, or Visual Studio.Job Types: Full-time, TemporaryPay: $64,380.00 - $100,000.00 per yearBenefits:Dental insuranceFlexible scheduleHealth insurancePaid time offProfessional development assistanceVision insuranceSchedule:Monday to FridayEducation:Bachelor's (Preferred)Experience:technical mentorship: 3 years (Required)CSS: 1 year (Required)React: 3 years (Required)Work Location: Multiple Locations",
        "title": "Front-end React Developer",
        "url": "https://www.indeed.com/viewjob?jk=450289cea517b4db"
    },
    {
        "companyLocation": "Chicago, IL+10 locations•Remote",
        "companyName": "OpenClassrooms",
        "details": "OpenClassrooms mentors are freelance senior professionals. They help students succeed in their training programs, through weekly video calls of maximum one hour each. It’s a 100% remote mission. You can coach up to 5 students from the beginning.The mentor's responsibilitiesTo be a role model and share their industry know-how with students on a weekly basis, coaching them through their training programs. All of the educational content is created and made available through the OpenClassrooms platform.As a mentor your main tasks during weekly meetings will be to:Guide and advise your students in the completion of the projects of their training program.Inspire your students with your advice and experience in your field.Monitor your students’ progress throughout the mentoring sessions.Report problems and difficulties related to your students.Experience and Skills RequiredOn the Front-End Developer path, students will carry out projects from A to Z and specialize in the optimization of their site's interfaces. Among the projects to be completed, the dynamization of a web page with CSS animations, the creation of a landing page with Javascript or the development of an analytics dashboard with React, during which you will coach them.You have a bachelor degree and at least 2 years of professional experience as a Front-End developerYou master Wordpress 5, Jquery, JavaScript, HTML 5, CSS 3, Bootstrap and ReactYou know how to simplify complex concepts, set objectives and give constructive feedback.You have a company structure or a freelance status (registered in your country of residence) or you are ready to create one.Apply in 4 Easy StepsComplete the mentor application form with an updated resume.If your profile is selected, you will be invited to make a short video. This is an opportunity for us to learn more about your skills.Your profile is selected! Send us the necessary documents to set up the contract: we take care of everything.We send you your contract in a digital format, all you have to do is sign it, 100% online.Know more about OpenClassroomsOpenClassrooms is a mission-driven company that makes education accessible to everyone, everywhere.We are the leading online education platform in Europe and Africa, offering fully-accredited online diplomas based on the skills of the future. Each month, at least 300 000 free students from around the world connect to our platform, and we currently count more than 10 000 degree students.We are very proud to be part of the B Corp community (more than 3,500 companies that combine profit and general interest), and to have the Great Place to Work label. OpenClassrooms is also part of the Next40 group for the second consecutive year.We have recently announced a new fundraising of 80 million dollars. This will help us invest in our product, continue our growth and make education even more accessible across the world!Why become a Mentor?100% remoteFlexibility, as a Freelancer - Make your own scheduleDevelop pedagogical skillsIncrease your income20% discount on OpenClassrooms training programsJoin a networking community of 3000 professionalsRecruit future colleagues!Are you ready to help students succeed? Submit your application today!Job Types: Part-time, ContractSalary: From $34.77 per hourWork Location: Remote",
        "title": "Front-End developer (remote)",
        "url": "https://www.indeed.com/viewjob?jk=a197558c0ea808b5"
    },
    {
        "companyLocation": "Texas+126 locations",
        "companyName": "Revature",
        "details": "In the next 4 weeks, Revature is looking to hire over 300 Front End Developers across the country. We are the largest employer of emerging tech talent. One day someone is going to ask you where you got your start…This is IT! With a wide range of Fortune 500 enterprises, government organizations and top systems integrators as our clients, we not only provide you with the skills needed to succeed through an employer-paid training program but will also give you the opportunity to put those skills to use, on projects that matter. What We Are Looking For College degree (Associates or Bachelors) Must be authorized to work in the US Strong desire to learn to code – No prior professional experience required. A natural problem solver Strong communication and interpersonal skills Willing to relocate anywhere in the US – Relocation assistance provided What We Offer Competitive salary Relocation & housing assistance Health, vision & dental insurance Paid time off Industry Certifications Life Insurance Policy 401k Mentoring program and ongoing support throughout your entire Revature career Experience with the largest and most reputable companies in the US Apply Today. Interviews are going on now. #SoftwareEngineering Equal Employment Opportunity The Company is an equal opportunity employer. We will extend equal opportunity to all individuals without regard to race, religion, color, sex, pregnancy, childbirth or related medical conditions, sexual orientation, gender identity, national origin, disability, age, genetic information, marital status, veteran status, or any other status protected under applicable federal, state, or local laws. This policy applies to all terms and conditions of employment, including but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, benefits, compensation and training. If you require an accommodation to work based on any of these protected factors, please notify the Human Resources Department, and the Company will evaluate the request and provide an accommodation in accordance with applicable law. We seek to comply with all applicable federal, state and local laws related to discrimination and will not tolerate the interference with the ability of any of the Company’s employees to perform their job duties. Our policy reflects and affirms the Company’s commitment to the principles of fair employment and the elimination of all discriminatory practices.",
        "title": "Front End Developer (Entry level)",
        "url": "https://www.indeed.com/viewjob?jk=9c23f5aee48e4ec9"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Revint Solutions",
        "details": "**9-12 Month CONTRACT**Description: This position is responsible for creating and maintaining processes which send and receive data between Cloudmed and our clients using a variety of formats and methods and performing basic support and troubleshooting tasks for the core application server. Additionally, will need to perform periodic updates to the core code and libraries to support the application as well as managing application releasesResponsibilities:Develop an in-depth understanding of the software tools used to load data in to and extract data from the Cloudmed applicationDevelop an in-dept understanding of the application in order to troubleshoot and perform updates when neededDevelop and maintain an understanding of how the data will be used in the application in order to troubleshoot the processesUpdate and maintain existing PHP scripts which perform data intake and extraction as neededUpdate and maintain a MySQL databaseUpdate and write MySQL queriesUpdate data directly in MySQLCreate new PHP scripts as part of client on-boarding as necessaryWork with the business and client technical contacts to define and understand key requirements such as format and frequency of the data being sent and receivedWork with the Cloudmed IT team to facility data transfer between the client and CloudmedTroubleshoot common issues in Linux (CentOS) command lineMaintain legacy batch scripts on Windows serverAnalyze log files in bash and PowerShellSchedule maintenance windows with the business to perform system and application updates as requiredThoroughly test updates to the code and scripts before they are deployedCreate and manage application releases using Azure DevOpsPerform other tasks and duties as required to support the applicationRequirements:Should have the following skills and experience:5+ years working with PHP and MySQLComfortable working with the Linux command-line over SSHExperience working with Protected Health InformationAble to communicate well with non-technical contactsAble to understand and update batch scripts on Windows ServerJob Types: Full-time, ContractPay: Up to $165,000.00 per yearSchedule:Monday to FridayEducation:Bachelor's (Preferred)Experience:PHP: 5 years (Preferred)MySQL: 5 years (Preferred)Work Location:Fully RemoteWork Location: Remote",
        "title": "PHP Developer",
        "url": "https://www.indeed.com/viewjob?jk=d0f6bdbdb6ea2a25"
    },
    {
        "companyLocation": "Beaverton, OR 97007 (Neighbors Southwest area)•Remote",
        "companyName": "Grey Ghost Studio, Inc",
        "details": "Grey Ghost Studio is looking for an outgoing and energetic individual who has strong programming skills, is a self-starter, and has a sharp attention to detail to join our team as a frontend web developer. The ideal candidate is highly motivated, has an eye for design, and constantly seeks to improve, propose, and implement processes to make our team more efficient and effective. The frontend web developer will be working with a cross-functional team to bring designs to life and responsible for end-to-end production, including pre and post-launch work.RoleIndependently adapt design compositions (Figma, Sketch, or InVision) to fast, responsive static sites.Provide strong troubleshooting and debugging during all phases of the project life-cycle.Communicate and work closely with back-end developers and other technical staff.Contribute to the frontend architecture for enterprise-level websites.Must HavesCan demonstrate fluency in HTML5 and CSS through Sass and grid frameworks such as Bootstrap.Extensive experience with Javascript and libraries such as JQuery, Angular, or React.Strong experience in responsive web design with a focus on performance.Experience consuming RESTful services and working in a Service-Oriented Architecture.Experience with GIT source code repos.Nice to HavesExperience with Storybook UI components.Adhere to modular and accessibility best practices.Understanding of CMS platforms such as Sitecore, Umbraco, or WordPress.A four-year college degree in a related field such as computer software engineering is preferred but will substitute for boot camps/two-year degrees, industry training, and technical certifications. Previous agency experience is strongly preferred.If you are interested in this opportunity, please APPLY directly here. No recruiting agencies, please. Accepting local applicants only. That means you currently live in the Portland-Metro area or surrounding areas of Oregon. No relocation. No remote candidates. When applying, please include links to any relevant public websites you’ve worked on.Grey Ghost Studio, Inc is an EEO employer.Job Type: Full-timeBenefits:401(k)Dental insuranceFlexible scheduleHealth insurancePaid time offVision insuranceSchedule:8 hour shiftMonday to FridayCOVID-19 considerations:Currently working 100% remote.Application Question(s):What is your minimum salary requirement?Education:Associate (Preferred)Work Location: One location",
        "title": "newFrontend Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=9d7a3b0a616a9e39"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Travel Zap Inc.",
        "details": "We are looking for an experienced ReactJS Front-End developer to join our Platforms & Engineering team to help us drive the next-phase of our product development. This role will involve extensive hands-on ReactJS knowledge to solve current and future UI development challenges. You will design and build feature-rich user experiences that provide a consistent look and feel across all of our products. Always thinking about a mobile-first best-in-class user experience and leveraging cutting-edge data visualization techniques and modern UI/UX design guidelines, you will help build the next generation of our products.This is an opportunity to join a team that will be making a seismic impact on not only our company but the way consumers search, book, and manage their group travel. As part of our Platforms & Engineering team, you will help build this new technology from the ground up. Reporting directly to the Platforms & Engineering Leader you will analyze requirements and collaborate with product owners and the development team to design scalable, secure, and robust software.You will focus on three core things: 1. Contribute to design and lead the development of all product UI.2. Improve architecture and coding standards across all front-end implementations.3. Serve as a strong hands-on developer that will address the existing needs of the business while always building for the future.Responsibilities: You code, test, and deliver implementations of premium quality that solve the business needs and simultaneously advance the architecture of our products.You deliver complete UI implementations that the back-end team can integrate with.Must be able to lead technical discussions when needed.You stay current on modern technologies and innovations which can further enhance and improve our products.Measure, find, and fix performance, security, and usability issues.Required Qualifications: Minimum of 4 years professional experience using ReactJSRedux or other state management libraries in the React ecosystemExtremely strong Front-End Development experience with proven success building external-facing web and mobile-friendly applications using ReactJS.HTML/CSS/JavaScriptPreferred Qualifications: Experience with the following:Material-UI components (mui.com)FigmaTypeScriptJira, Slack, GitHubWorking with offshore team membersWorking in an Agile/Scrum environmentJob Type: Full-timePay: From $100,000.00 per yearBenefits:401(k)Dental insuranceHealth insuranceLife insurancePaid time offParental leaveVision insuranceSchedule:8 hour shiftEducation:Bachelor's (Required)Experience:Front-end development: 4 years (Required)ReactJS: 4 years (Required)CSS: 4 years (Preferred)Work Location: Remote",
        "title": "ReactJS Front-End developer",
        "url": "https://www.indeed.com/viewjob?jk=5470037932eaaf1c"
    },
    {
        "companyLocation": "Lynchburg, VA 24515",
        "companyName": "Liberty University",
        "details": "JOB SUMMARY The HTML Developer is responsible for exercising good judgment and discretion regarding best email and HTML practices for University Marketing. Successful applicants are self-starters, and motivated to present department leadership with new and improved practices.ESSENTIAL FUNCTIONS AND RESPONSIBILITIESExercise strong technical skills including an expertise in HTML; Understanding of Web development tools / technologies such as CSS, Photoshop, Dreamweaver, and JavascriptExercise strong work ethic, Superior attention to detail; Advanced organizational, time-management and work prioritization skillsAbility to function in a high pressure/high ambiguity environment; Strong bias toward action and results-oriented activitiesBasic send and deliverability monitoring; uploading HTML/Text content to email platform; Link tracking and email deployment using proprietary email platform.Work with project teams in coordinating and communicating content change requests and adhering to production schedulesQuality assurance of all emails, verifying dynamic content, applying dynamic content rules and configuring link tracking; dynamic content codingServe as expert on email best practices and educating others. Remains abreast of existing and emerging technologies, processes, products, services and leading industry performance benchmarks.Work effectively as a team member, embracing and fostering LU’s mission. Strong interpersonal communication skillsQUALIFICATIONS AND CREDENTIALSEducation and Experience Preferred four-year college degree in Computer Science, or similar field, + 6 months experience, minimum. Well-developed communications skills.ABILITIES AND COMPETENCIES ESSENTIAL TO THE FUNCTION OF THE JOBCommunication and Comprehension Ability to effectively communicate both verbally and in writing to convey clear, well articulated information.Ability to understand, speak, and write English in order to convey messages and correspond in an articulate and professional manner.Possess public communication skills that allow professional representation of Liberty University to a variety of business and community customers and associates.Strong organizational skills.Excellent computer skills.Problem SolvingIntuitively able to reason, analyze information and events, and apply judgment in order to solve problems of both a routine and complex nature.Physical and Sensory Abilities Frequently required to sit for extended periods to perform deskwork or type on a keyboard.Regularly required to hear and speak in order to effectively communicate orally.Occasionally required to stand, walk, and climb stairs to move about the building.WORKING CONDITIONS Work EnvironmentThe working environment in which one will typically perform the essential functions of this position is a climate-controlled office setting. It is well lit and the noise level is moderate.This job description is designed to provide an employee with a basic understanding of the essential functions, duties, and responsibilities entailed in the performance of his or her job with Liberty University (LU). It is not intended to be all-inclusive. This description does not constitute an employment contract, either expressed or implied. Employment with Liberty University is at-will and may be terminated by either the employee or LU with or without advance notice for any reason or for no reason at all. Only the President and Chancellor is authorized to make changes to any LU policy. Job functions and responsibilities are subject to change at the discretion of management. Efforts will be made to provide advanced notice of such changes whenever possible.Job Type: Full-timePay: $37,000.00 - $42,000.00 per yearSchedule:8 hour shiftWork Location: One location",
        "title": "newHTML Developer",
        "url": "https://www.indeed.com/viewjob?jk=f6357dbc1f275fe7"
    },
    {
        "companyLocation": "Flushing, NY 11354",
        "companyName": "Firstrade Securities Inc.",
        "details": "Responsibilities· Build next-generation web applications with a focus on the client side.· Maintain and update the company web pages· Collaborate with experienced designers to iterate on the design and implementation of our product.· Be able to write clean, scalable, standards-compliant, reusable, quality code with strong knowledge of OO design.Minimum qualifications:· Bachelor's degree in technical discipline or equivalent practical experience with modern JavaScript libraries and tooling· knowlege of relational databases (MySQL, Oracle)· Commanding grasp of HTML, CSS, php, javascript and familiarity of at least one framework like reactJS.· Awareness of cross-browser compatibility issues and client-side performance considerations· Curiosity and commitment to learning and skill-sharingPreferred qualifications:· At least one year of professional programming experience.· Good understanding of asynchronous request handling, partial page updates, and AJAXKnowledge of web libraries and programming language such as java .· Familiarity with the whole web stack, including protocols and web server optimization techniques· Bilingual Chinese preferredJob Type: Full-timePay: $50,000.00 - $55,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee discountFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offReferral programRetirement planVision insuranceSchedule:8 hour shiftMonday to FridayCOVID-19 considerations:Mask is requiredAbility to commute/relocate:Flushing, NY 11354: Reliably commute or planning to relocate before starting work (Preferred)Education:Bachelor's (Preferred)Experience:Front-end development: 1 year (Preferred)CSS: 1 year (Preferred)php: 1 year (Preferred)Work Location: One location",
        "title": "Entry Level Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=65f2f74d3fbf6813"
    },
    {
        "companyLocation": "Austin, TX 78750•Remote",
        "companyName": "Security Service Federal Credit Union",
        "details": "Completes work as a full-stack developer using the .NET platform and contributes to all aspects of the software development cycle: from design and development, all the way to support and documentation. Participates in the design process of our solutions, providing feedback and technical expertise needed to keep our applications efficient and easy to maintain. Uses software development skills and experience in areas such as Customer Relationship Management (CRM), sales, and member-facing applications like Online Banking. As an experienced professional, you will be performing these tasks under limited direct supervision. Partners with analysts to ensure accuracy and completeness of requirements documentation for assigned projects. Helps develop technical solutions through collaboration with team members ensuring a full understanding of the requirements. Helps creates technical design, and application functionality documents. Assists in technical design and code reviews to ensure smooth daily operations and accurate planning. Completes any other job-related duties needed to help drive to our Vision, fulfill our Purpose, and abide by our Organization's Values. Requirements: Bachelor's Degree in Management Information Systems, Computer Science, Engineering, or comparable education and/or experience. Minimum of one (1) years of software development life cycle management experience. Exposure to front-side (e.g., HTML, CSS, JavaScript) and database (e.g., MySQL, Oracle) tools to create websites from concept to finished product (front-end and back-end). Proficiency in server, network, and hosting environments, relational and non-relational databases, how to interact with APIs, user interface/experience, quality assurance, version control systems, and security. Understanding of Object-oriented programming principles, in addition to C# programming, HTTP, Git and front-end-framework for responsive design (Bootstrap). Able to work in a team environment and meet deadlines. Strong interpersonal, presentation, analytical, written, and verbal communication skills.",
        "title": ".NET Web Developer I",
        "url": "https://www.indeed.com/viewjob?jk=e35d21b15568e58a"
    },
    {
        "companyLocation": "Temporarily Remote",
        "companyName": "Apartments247.com",
        "details": "Front-End Web DeveloperCompany DescriptionApartments247 designs and develops websites and marketing tools for apartment communities and the residential property management industry. We have been a technology leader in the real-estate marketing industry for 20 years. Here at Apartments247, we combine the innovation, agility, and culture of a startup with the stability and experience of leading industry marketing strategists.*Our engineering team is located in Las Vegas, NV -- just minutes away from Red Rock Canyon and the Las Vegas Strip. This is a work from home opportunity.**ResponsibilitiesWork with other members of the Apartments247 team to design, architect, and implement solutions to problems in the multihousing marketing industry.Participate in peer-code reviews to give and receive feedback on code changes.**QualificationsExperience writing W3C compliant accessible HTML5 markupExperience with modern vanilla Java ScriptExperience with CSS, as well as preprocessors as Sass or LessFamiliarity with modern JavaScript command-line tools such as npm and gruntComfortable working with REST APIs and JSON. Experience with SOAP and XML a plus!Comfortable working with REST API's and JSON dataExperience using Git for version control. If you’ve got a GitHub, send us a link to your profile!Backend development experience is a huge plus !*Job Type: Full-timePay: $15.00 - $40.00 per hourBenefits:Dental insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:Monday to FridayEducation:Bachelor's (Preferred)Experience:JavaScript: 1 year (Preferred)Angular: 1 year (Preferred)Work Location:Fully RemoteCompany's website:https://www.apartments247.com/Benefit Conditions:Waiting period may applyOnly full-time employees eligibleWork Remotely:Temporarily due to COVID-19COVID-19 Precaution(s):Remote interview processSocial distancing guidelines in placeVirtual meetingsSanitizing, disinfecting, or cleaning procedures in placeWork Location: Remote",
        "title": "Front-End Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=66a6d33074acce08"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Peklava LLC",
        "details": "As a member of a very small but established and successful team, you'll play an important role growing the scale of our company. We are looking for a candidate with the technological knowledge to design, build, and maintain websites for our new brands. In order to be successful in this role, you will need a thorough understanding of Linux, PHP, JavaScript, HTML, CSS, WordPress, and other related web development platforms and frameworks.Your mission is to build. We move fast and break things and iterate constantly to evolve towards optimal performance.You will design, build and maintain multiple web properties focused on helping consumers compare personal financial products and make informed decisions. Our largest brand is www.ratezip.com where tens of thousands of visitors go to compare mortgage programs and other financial products.Why Us?For this to be the right fit, you must want to work on a very small team. You will work directly with the company founder, developer, and content editor. There are no politics, and no bureaucracy, just direct action and results. You will be evaluated and compensated based on your results, which are measurable.You can work remotely or in our office, the choice is yours.We will offer a competitive base salary.We offer a 401k and employer contributed health coverage.Job Type: Full-timePay: From $100,000.00 per yearBenefits:401(k)Paid time offSchedule:8 hour shiftMonday to FridayOn callEducation:Bachelor's (Preferred)Experience:Front-end development: 1 year (Preferred)CSS: 1 year (Preferred)Work Location: Remote",
        "title": "newFull Stack Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=29155a10299fdba5"
    },
    {
        "companyLocation": "Milwaukee, WI",
        "companyName": "BVK",
        "details": "BVK seeks a highly skilled computer programmer who is expert in front-end programming and has significant experience with WordPress. Our teams work collaboratively to deliver best-in-class website and application solutions. If you have a desire to work on a team that centers around thought-sharing and thought-leadership, but also provides room for creative freedom and professional development, then you should join BVK. This position is full-time, salaried, and based in the Chicago/Milwaukee region. Onsite work at our Milwaukee office is required at least 1 day per week. Remote work must be performed during regular business hours CST (Central Standard Time). Job Responsibilities and Duties: Develop front end website code in CSS, HTML, JS and PHP. Ensure cross-platform optimization for mobile devices. Ensure responsiveness of applications. Conduct testing including unit, system load and performance. Ensure websites meet current web content accessibility guidelines (WCAG 2.1). Work collaboratively with designers, UX strategists and management. Stay abreast of developments in web applications and programming languages. Perform other duties as required. Skills and Qualifications: 4 year degree in Computer Science/Front-end Development or 2 years equivalent experience in an agency or corporate digital environment. Expertise with fundamental front end languages such as HTML, CSS, JavaScript/jQuery, PHP, AJAX, JSON. Ability to troubleshoot performance issues. Understanding of UX/UI design principles. Ability to translate designs into pixel-perfect web code. Excellent verbal communication skills. Good problem solving skills and attention to detail. WordPress-specific Requirements: Ability to program a WordPress theme from scratch. Ability to write clean, well-engineered code that conforms to accepted standards within the WordPress community. Ability to create and configure custom plugin to meet requirements. Ability to integrate WordPress with third-party applications and APIs",
        "title": "newFront-end Developer",
        "url": "https://www.indeed.com/viewjob?jk=60829ba6796dc412"
    },
    {
        "companyLocation": "Remote",
        "companyName": "SCG",
        "details": "This role requires a background in web development, programming capabilities in JavaScript, with a preference for additional web programming languages/frameworks including (but not limited to) Angular, JSON, SCSS, and HTML.Responsibilities: Provide input as a subject matter expert into behavioral tracking strategies to assist product analytics and marketing analytics.Tool administrative for our downstream MarTech solutions which include: Adobe Analytics, Audience Studio, Adobe DSP, etc.Translate business requirements into Web Analytics, Tag Management System and A/B Testing platform implementation.Develop, customize and troubleshoot campaign code in complex environments with the heavy use of JavaScript, HTML and CSS.Manage data quality within marketing technology tools and develop solutions to remediate data quality challenges.Implement analytics tracking code and perform quality assurance to ensure tagging is working as planned. Implement mechanisms to perform data validation against source systems to ensure tracking is accurate.Implement analytics tracking code needed for ongoing reporting and analysis activities.Proactively monitor the marketing tools; this includes performance, users, license restrictions, security and data quality.Hands on design and development of custom solutions built within marketing technology tools including declarative development, scripting, data modeling, and integration.Define and maintain the enterprise wide data model for the web data layer. Update the data model when needed for specific products.Requirements: Strong JavaScript development skillsExperience implementing and/or working with clickstream web analytics tools such as Adobe Analytics (Omniture SiteCatalyst), Google Analytics; or working knowledge of the field of web analyticsKnowledge of/experience with A/B Testing platforms (Test&Target, Optimizely, Optimost, Google Optimize)Knowledge of/experience with Tag Management Systems (Tealium, Ensighten, Adobe Launch, Google Tag Manager)Working knowledge of SDLC processes and how to integrate those processes with tag management solutionsExperience working with integrated development environments, source code management systems and workflow management systemsBachelor's Degree or equivalent (Computer Science, Information Technology, or Information Sciences degrees preferred)Minimum of 2 years of professional work experienceWorking knowledge of modern JavaScript/TypeScript web application development using Angular, React, or equivalentExperience with site tagging including desktop, mobile, video and OTT for digital properties with high traffic volumesWillingness to learn and take on the challenge of managing multiple marketing technology tools.Job Type: Full-timePay: $100,000.00 - $130,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programEmployee discountFlexible scheduleFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offParental leaveProfessional development assistanceTuition reimbursementVision insuranceSchedule:8 hour shiftDay shiftMonday to FridaySupplemental Pay:Bonus payApplication Question(s):Do you currently, or will you in the future, require sponsorship?Experience:JavaScript development: 5 years (Preferred)Google, Adobe or comparable analytics tool: 5 years (Preferred)Tag Management: 5 years (Preferred)Work Location: Remote",
        "title": "Web Analytics Developer",
        "url": "https://www.indeed.com/viewjob?jk=e922780235cc4ebd"
    },
    {
        "companyLocation": "Waukesha, WI 53186",
        "companyName": "Kalmbach Media",
        "details": "Kalmbach Media is a consumer-driven company with industry-leading brands striving to deliver high-quality content and experiences to our online audiences. We are seeking a WordPress Developer who will team up with the Digital Marketing Team and other departments across the Company to deliver excellent on-page experiences. As part of the marketing team, you will be tasked with creating and editing Kalmbach's websites and their connectivity to other marketing stack tools. Mixing your technical expertise with our brands and vision, we will deliver an exceptional, secure user experience to every visitor on a platform built to scale. Data is at the core of our strategy development and drives our business decisions. This person will also work closely with the Digital Analytics Director to ensure high-performing sites and accurate capture of analytics. Job Duties and Responsibilities Create and customize WordPress themes and plugins. Design and implement new features and functionality. Ensure high-performance and availability, managing all technical aspects of the CMS. Continuously optimize our websites for performance, speed, and security. Troubleshoot and debug WordPress sites and web applications. Perform regular maintenance tasks including theme updates, plugin updates, security updates, etc. Guide projects from kick-off to final launch. Define, create, and document any technical requirements for assigned tasks. Assist in assignment of work and establishing realistic timelines. Assist with maintenance of hosting and with underlying technical architecture for WordPress websites, web applications, and other online content. Communicate effectively with the Director of Digital Strategy on status updates and direction of the sites and platform. Education and Experience WordPress development skills required. 5+ years of management of one or multiple business WordPress sites preferred. Excellent understanding of HTML, CSS, Javascript, responsive design, and other website best practices. Working knowledge of PHP, MySQL and server administration a plus. Be fluent with website analytics tools, including Google Search Console and other related to technical SEO. In-depth knowledge and expertise of the web development process, including creating, designing, customizing, and deploying websites. Excellent analytical and critical thinking skills. How to Apply To be considered for this position you must complete our online application and attach your resume along with: A detailed cover letter outlining your qualifications and experience as it relates to this position Your salary requirements Kalmbach is located in Waukesha Wisconsin, about 20 minutes west of Milwaukee. We offer a hybrid work environment and excellent benefits! EOE",
        "title": "WordPress Developer",
        "url": "https://www.indeed.com/viewjob?jk=2637fe061cf42bea"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Offchain Labs",
        "details": "Offchain Labs is building a suite of scaling solutions for Ethereum. This includes Arbitrum, an Optimistic Rollup, that instantly scales apps, reducing costs and increasing capacity, without sacrificing Ethereum's security. Porting contracts to Arbitrum requires no code changes or downloads since it’s compatible with existing Ethereum developer languages and tooling. Our team is extremely passionate and works tirelessly to bridge the gap between what blockchain is and what blockchain can be. We strive to maintain an atmosphere that fosters innovation and new ideas through collaboration, research, and deep discussions. After raising an initial round of $3.8M in seed funding in January 2019 and a $20M series A, as well as a $100M series B in 2021, we are ready to hire additional team members that have an interest in working in the blockchain space and a knack for approaching problems in unconventional ways. Who you are: Excited to learn and develop blockchain technology (No experience yet? No problem!) Expert in Front-end development Experience with React.js, CSS3, Typescript, Javascript Bonus: Solidity Possess a strong sense of ownership in your work, which drives you to find ways to do things better and faster Always up-to-speed on the latest technologies Constantly on the lookout for new and innovative ways to solve complex problems through rigorous experimentation Your communication style is open, transparent, and direct, and you consistently work in tight collaboration with your teammates Always open to feedback, new ideas, and opportunities for self-improvement You look for ways to help out beyond the scope of your day-to-day work What you've done: Have dabbled in, educated yourself on, or are experienced working on blockchain technology Eager to bring cutting-edge research to the real world and help build a platform for the next generation of cryptocurrency applications Security-minded and always keeping an eye out for potential threats and vulnerabilities in your code Mastered CS fundamentals, either in a formal university program or through self-learning We understand it takes a diverse team of highly intelligent, passionate, curious, and creative people to solve the challenges involved in developing and improving Arbitrum. Our dynamic team has incredible perspectives to share, just as we know you do. We take great pride in being an equal opportunity workplace.",
        "title": "Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=544e6a9bec24aca3"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Range Marketing",
        "details": "Job Title: Junior Web DeveloperReports To: Web Team ManagerJob Summary: At Range Marketing, we value building meaningful relationships, holding ourselves accountable, maintaining positivity within ourselves and others, and encouraging learning and change in everything we do. This extends not only to our employees but to our clients as well, as we strive to encourage the growth of the organizations we work with.With this in mind, we’re looking for a new Junior Web Developer to join our team! If you’re a good fit for the role, you have experience designing and developing websites for small and mid-sized businesses, strong communication and organizational skills, and a proven ability to coordinate simultaneous projects. You must also be able to work well with others and have the drive to research and implement emerging industry tactics and coding standards.In this role, you will assist the web team with small projects and tasks while also being trained to graduate into the role of a full Web Developer. Your performance will be evaluated on the structural quality, responsive compatibility, and visual appeal of client websites. Creating a conversion-focused user experience that performs well on all devices is key.Essential Functions: Front-end design and development of primarily WordPress websitesDevelop within our custom theme framework, which does not use any drag-and-drop or visual page buildersComplete Quality Assurance audits on completed websites that our Web Developers have builtComplete Client Revisions on completed websites that our Web Developers have builtComplete Tickets from clients on live websites - typically small requests such as adjusting images, content, and adding/removing sectionsComplete larger-scale projects that come from the Director of Technology - performance updates, ADA compliance updates, information organization updates, etc.Experience Required: A minimum of one year of experience in web design and development, preferably in an agency or marketing company environment. If there is no direct development experience, a BS in design/development OR personal experience with a portfolio is required. Experience with search engine optimization and digital marketing is preferred but not required. Candidates must have strong written and verbal communication skills.Necessary Skills: Front-end development: HTML, CSS/SCSS, Bootstrap, Javascript/jQueryDesign: Adobe Photoshop, Adobe IllustratorPersonal: self-sufficient, leader, time-management, ability to perform well under pressurePreferred/Bonus Skills: Backend developmentDigital marketing: SEO, PPC, copywritingWork RemotelyYesJob Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceHealth insurancePaid time offSchedule:8 hour shiftMonday to FridayCOVID-19 considerations:We have full capabilities to work remotely 100% of the time.Ability to commute/relocate:Buffalo, NY: Reliably commute or planning to relocate before starting work (Preferred)Application Question(s):Do you have a portfolio? If so, please provide a link.Why are you interested in this job?What is your expected salary range?Experience:Front-end development: 1 year (Preferred)Back-end development: 1 year (Preferred)Web development: 1 year (Preferred)Work Location: Remote",
        "title": "Junior Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=d00b42dbaab1405c"
    },
    {
        "companyLocation": "+126 locationsRemote",
        "companyName": "Amazon.com Services LLC",
        "details": "3+ years of software development experience. Bachelor’s degree in Computer Science or a related discipline. Experience with data structures, and algorithms. Operational experience with responsibility for system reliability and uptime. Experience with modern programming languages such as JavaScript, ReactJS, and Typescript (preferably on a UNIX or Linux platform) Job summary AWS Systems Manager is the operations hub for the AWS cloud. Many customers from startups to enterprises are running their entire infrastructure or parts of it in AWS. Operating this infrastructure in the cloud in a reliable way is absolutely important to our customers and we are a core part of that story. Many IT administrators and DevOps engineers rely on Systems Manager to operate their infrastructure safely and securely at scale. Systems Manager provides a unified operational dashboard to view operational data from multiple AWS services, manage large fleet of instances, manage their distributed applications as a single unit and automate their operational tasks/runbooks and define safe operational workflows. More info on Systems Manager: https://aws.amazon.com/systems-manager/). A day in the life We are looking for a looking for a FEE to build highly distributed systems aimed at providing safe operating capabilities for our customers. You should be passionate about being part of a world-class team that welcomes, celebrates, and leverages a diverse set of backgrounds and skillsets to deliver results. Driving results in a way that builds on our inclusive culture is expected of an FEE and is key to our long term success. Master’s degree in Computer Science or a related field. Experience with Java and AWS services Understanding of security and compliance principles and best practices Meets/exceeds Amazon’s leadership principles requirements for this role Meets/exceeds Amazon’s functional/technical depth and complexity for this role The pay range for this position in Colorado is $130,000 -$160,000/ yr; however, base pay offered may vary depending on job-related knowledge, skills, and experience. A sign-on bonus and restricted stock units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. This information is provided per the Colorado Equal Pay Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.",
        "title": "newFront End Engineer",
        "url": "https://www.indeed.com/viewjob?jk=3edbfd3c4c39743e"
    },
    {
        "companyLocation": "Random Lake, WI 53075",
        "companyName": "Bertram Communications",
        "details": "LAMP Developer Headquartered in beautiful Random Lake, WI, Bertram Communications LLC is a family-owned company that provides wireless Internet connectivity across the State of Wisconsin as well as software and hardware products for the ISP industry, government services and beyond. Competitive pay, benefits and a relaxed and fun work environment are just some of the many perks included when working for Bertram.We are looking to hire talented LAMP developers with a focus on backend software development. Intermediate to advanced experience using PHP, *SQL, JavaScript and web application development in general is a must. While this position is primarily for a back-end developer, full-stack knowledge is required.Requirements:* Intermediate to advanced knowledge of PHP, SQL (MySQL or Postgres preferred), JavaScript and web development in general* Strong work ethic* Ability to write coherent, organized code and be comfortable working on a mature, complicated code base ( >2.5 million lines)* Strong Object Oriented Design and architecture skillsJob Type: Full-timePay: $70,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceHealth insuranceLife insurancePaid time offRetirement planVision insuranceSchedule:8 hour shiftDay shiftMonday to FridayOn callOvertimeCOVID-19 considerations:We are following all CDC guidelines to keep our employees and customers safe.Application Question(s):How many years of PHP experience do you have?Education:High school or equivalent (Preferred)Experience:REST: 3 years (Preferred)Java: 3 years (Preferred)Work Location: One location",
        "title": "Developer",
        "url": "https://www.indeed.com/viewjob?jk=2ac83ec1e838ed9d"
    },
    {
        "companyLocation": "Lake Villa, IL 60046",
        "companyName": "Great Lakes Fund Solutions, Inc.",
        "details": "We are looking for a ONSITE programmer / web developer to join our team on a full time basis.We are a small, rapidly growing, investment fund administration firm. Working with experienced professionals, you will be responsible for designing and developing software for financial administration applications.Work is in PHP and Python / Flask environments served by Ubuntu Linux. Some work may involve other languages and technologies as required.Qualifications2 years of programming experience. A strong working knowledge of programming with PHP and Python. A willingness to learn, work hard, and offer great ideas, is expected.Preferred qualifications: Hands-on experience with version control and deployment technologies (Git), MySQL, Ubuntu Linux, Python/Flask. Financial services industry experience is a plus.Job Type: Full-timePay: $45,000.00 - $90,000.00 per yearBenefits:401(k)401(k) matchingHealth insuranceHealth savings accountLife insurancePaid time offParental leaveSchedule:8 hour shiftDay shiftMonday to FridaySupplemental Pay:Bonus payAbility to commute/relocate:Lake Villa, IL 60046: Reliably commute or planning to relocate before starting work (Preferred)Experience:programming: 2 years (Preferred)Work Location: One location",
        "title": "Programmer/Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=6ab2d1642287a5ec"
    },
    {
        "companyLocation": "Oak Creek, WI 53154",
        "companyName": "ITProMark",
        "details": "Send your resumes with Job Code and Title in the subject to jobs@itpromark.com REQUIREMENTS: REQUIREMENTS 5+ years of solid ASP, VB, ADO and .Net programming, and data architecture experience. Should be Microsoft Certified Proffessional in ASP.NET Experience in design and development of XML Services. Should be able to Design and implement the Dataflow,Tables,Stored Procedures on SQL Server 2000/2005 Additional experience doing UI work in ASP.NET, ASP to ASP.Net migrations is a big plus Experience with hosted software (ASP's), web marketing software and methodology, and web traffic analysis/sales CRM is helpful. Experience working in a Financial/Telecom Industry would be a big Plus. EDUCATION: Bachelors degree in computer science or any equivivalent is required; Masters Degree in CS/MIS or any related field would be an added plus.",
        "title": "Sr Applications Developer",
        "url": "https://www.indeed.com/viewjob?jk=5bc7e0c4dd780961"
    },
    {
        "companyLocation": "New York, NY+1 location•Remote",
        "companyName": "Public Goods",
        "details": "Public Goods is building a destination for consumers who care about their impact. We're looking for kind, mission-driven people who want to work with high-performing and highly collaborative teams — people who want to make a visible impact on the company and, ultimately, the world. We're growing fast and have investors who've backed category-defining businesses such as Peloton, Kickstarter, and Etsy.Sustainability is a huge deal for us. Our environmental initiatives run deep and go beyond our successful tree-planting program. We donate to food banks, partner with leaders in the fight against deforestation and hunger, design products with smaller carbon footprints, and carbon offset 100% of orders.Public Goods is seeking a passionate Junior Web Developer who will develop high-quality web pages. The ideal candidate has an eye for design, is a creative problem solver, and wants to learn. This position will collaborate across teams that include creative, editorial, product, brand partnership, merchandising, and growth marketing. The Junior Web Developer will be capable of transforming layout designs into functioning web pages with web performance in mind. This position reports to the Lead Web Developer and can be remote.What you'll do:Take mockups and convert them into fully functioning and responsive web pages.Conduct QA for all devices on web pages that have been built.Manage multiple projects in an agile environment.What you'll bring:0-1 year of hands-on web development experience.Experience with modern web technologies and techniques such as HTML5, CSS3, CSS frameworks, CSS pre-processors, and Javascript/jQuery.Experience in eCommerce development (Shopify).Knowledge of responsive design and general web standards.Debugging and diagnosing problems using DevTools.Experience with design tools like Figma.Knowledge of basic Git.Who you are:Ability to work under deadlines.Responsive to changing needs and priorities.A strong sense of ownership and accountability.Strong work ethic and ability to work effectively independently and in collaborative team environments.Attention to detail.Appetite to learn and grow as a developer.What we offer:Competitive compensation package.100% covered Medical/Dental/Vision/telemedicine services for employees.401(k).A free Public Goods membership and a $50 monthly employee credit.$25 monthly book credit.12 weeks paid maternity leave.Job Type: Full-time",
        "title": "Junior Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=0affa165fc88aa1e"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Chicago Advertising Agency",
        "details": "We are a small but growing advertising agency in the Chicago area looking for someone to help with website maintenance and development. It’s helpful if you have some design background but it’s not required.This is a long-term part-time position that will be offsite with flexibility hours. All levels of experience will be considered including everyone from students to mid-sized design shops. We prefer hiring someone from the Chicago area or at least in the Midwest, but we’re open to other areas. We are not interested in OVERSEAS help.The candidate should be passionate, focused, responsible, and professional. Our company has grown because clients know they can count on us for timely and professional work. We also like self-starters who thrive on problem solving and seeking new technologies and platforms.Please mention if you also have experience with website design, Wordpress or any other web development, digital or design skills. Please send a portfolio or samples of your work along with resume and hourly rates.ThanksJob Type: Part-timePay: $15.00 - $40.00 per hourApplication Question(s):What is your hourly rate?What is the link to your portfolio?Experience:Web design: 1 year (Preferred)CSS: 1 year (Preferred)WordPress: 1 year (Preferred)Work Location: Remote",
        "title": "Web Designer/Developer",
        "url": "https://www.indeed.com/viewjob?jk=1ad7ff9452c44a34"
    },
    {
        "companyLocation": "Remote",
        "companyName": "FieldRoutes",
        "details": "Web Developer II @ FieldRoutes Marketing Who we are! FieldRoutes™ is a Cloud-based and mobile SaaS provider for field service businesses. The platform automates all aspects of field service operations for enterprise and small business customers that span office management, advanced route optimization, payment processing, digital sales, marketing, and customer acquisition solutions that accelerate growth, streamline operations, increase customer retention, and maximize revenue. What you'll be doing As a Web Developer II, you would join a growing development team and use a mix of HTML5, CSS3, and React to bring to life the designs created by our team of expert designers. Additionally, you will; You will be delivering amazing front-end experiences for desktop and mobile using modern JS frameworks, most notably React and Gatsby Assist with monitoring and responding to development tickets submitted by the marketing and implementation teams Debug and problem solve as issues arise Minor site updates or bug fixes to existing website themes Custom CSS changes to client sites What we're looking for in you 1+ year of modern front-end development Proficient in HTML5, CSS3, Reactjs, and jQuery GitHub Ability to multi-task, prioritize, and manage time effectively. Strong problem-solving skills. An active learner willing to research and apply new technology as it becomes available. Excellent team player Knowledge of GraphQL, SCSS, Gatsby, and Rest API’s a plus. Some of the Perks Competitive compensation with starting salary range at $60,000.00 to $75,000.00 depending on experience Generous Paid Time Off – 18 days to start and 12 annual paid holidays Best-in-class health, dental and vision coverage, including Employee-only coverage options fully paid by the company and HSA options with company contributions 100% Company Paid Benefits including Life Insurance, Short Term Disability, and Long-Term Disability programs Traditional and Roth 401(k) Programs Progressive paid family (maternity/paternity) and adoption leave About Field Service Holdings LLC We are a remarkable company in remarkable times. Last year we grew 44% and hired 93 new team members. This year our targets are higher! We ranked at #1273 on the Inc 5000 list of America's Fastest Growing Private Companies and Forbes has named us on their list of \"Best Start-Up Employers\" in both 2020 and 2021 based on employee enthusiasm, fast-growth, and financial strength. In January 2020, we joined the portfolio of Gryphon Investors and have outstanding financial support. Together, we defend one another’s time by maintaining an entrepreneurial spirit. That means we squash the unimportant to make way for the work that brings value to the business. At FieldRoutes, you are well trained, respected, properly compensated, and not overworked. The results are our proof. We have capital from world-class investors and can tout a stellar employee Net Promoter Score of 59. That’s a fancy way of saying people come here for a fantastic job and stay because of our great culture. This Job Description indicates the general nature and level of work expected of the incumbent(s). It is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the incumbent. Incumbent(s) may be asked to perform other duties in addition to those described above. FieldRoutes, is an Equal Opportunity Employer and does not unlawfully discriminate on the basis of any status or condition protected by applicable federal, state, or local municipal law.",
        "title": "Web Developer II",
        "url": "https://www.indeed.com/viewjob?jk=7c1ce33eaf2773c1"
    },
    {
        "companyLocation": "St. Louis, MO",
        "companyName": "Anheuser-Busch",
        "details": "COMPANY Budweiser. Bud Light. Stella Artois. Michelob ULTRA. That’s right, over 100 of America’s most loved brands, to be exact. But there’s so much more to us than our top-notch portfolio of beers, seltzers, and more. We believe our people are our greatest asset, and we’re looking for people like you to join our shared dream. We dream big to create a future with more cheers. Are you up for the Challenge? ROLE SUMMARY The Web Developer is part of the Marketing Technology team based in St. Louis, Mo., and will be responsible for the creation, deployment, and maintenance of brand and e-commerce websites. You will be expected to scope all sites, provide recommendations, and leverage new technologies to increase retention and enhance the user experience. You’ll also be required to build strong relationships with internal Brand Managers and Leadership to facilitate updates, provide guidance, and implement strategy across our portfolio of brands. JOB RESPONSIBILITES Lead and manage the creation, testing, deployment, and maintenance of internal and consumer-facing websites Analyze current sites and provide strategic recommendations to improve user experience and increase retention Manage multiple projects at once, collaborating with agency partners on site upgrades and requested updates from partners Perform quality assurance and testing for websites and new product releases Re-size images, format content, and provided recommendations for optimization Job Qualifications Bachelor’s Degree in Web Development, Computer Science, Information Technology, or related field 5+ years or more front and backend experience 2 + years Shopify or other e-commerce platform Knowledge of the NFT space is a plus Advanced knowledge of website architecture as well as the following programming languages: HTML/CSS/JavaScript/jQuery Strong understanding of UI, cross-browser compatibility, general web functions and standards. Working knowledge of MySQL Databases UX design experience is a plus Strong communication skills Must be local and available to commute to St. Louis office WHY ANHEUSER-BUSCH Anheuser-Busch is here for the times that matter. The moments where we celebrate, defy challenges, dream of the brighter future we are building today– and all the moments in between. We are a company that brings people together for richer conversations, stronger communities and a future with more cheers! Challenge Accepted! Apply Today! BENEFITS Health benefits including Medical, Dental, Vision, Wellness and Tax-Advantaged Savings and Spending Accounts Life Insurance and Disability Income Protection Generous Parental Leave and FMLA policies 401(k) Retirement Savings options with a company matching contribution Chance to work in a fast-paced environment among a company of owners Free Beer! As the leading global brewer, Anheuser-Busch InBev is committed to finding innovative ways to continually improve. It's this kind of thinking that creates a unique work environment by rewarding talent, celebrating diversity, and encouraging forward thinking. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, or any other characteristic protected by applicable law.",
        "title": "newWeb Developer",
        "url": "https://www.indeed.com/viewjob?jk=f3e42e9f67c95028"
    },
    {
        "companyLocation": "Remote",
        "companyName": "BeaconFire Solution",
        "details": "Responsibilities:· Develops software and web applications using Java 8/JEE (and higher), AngularJS, React.js, SQL, Spring, and HTML5, among other tools;· Invests time in constant professional development so you are up to date with new technological developments and programming languages;· Writes scalable, secure, maintainable code that powers our clients’ platforms· Creates, deploys, and maintains automated system tests;· Works with Testers to understand defects opened and resolves them in a timely manner;· Supports continuous improvement by investigating alternatives and technologies and presenting these for architectural review;· Collaborates effectively with other team members to accomplish shared user story and sprint goals;· Discovers and fix programming bugs.Basic Qualifications:· Bachelor's degree or higher in Computer Science or related fields;· A passion for accomplishing great things by creating fast, maintainable, and valuable applications;· Good understanding of Object-Oriented Programming (OOP) concepts and enterprise designPatterns;· Proficient with modern JavaScript language (i.e. ECMAScript 6+);· Strong understanding of web standards (HTTP protocols, browser, Html, etc.).Preferred Qualifications:· Master’s Degree in Computer Science or related field;· Familiarity with at least one MV* JavaScript framework (Angular.js, React.js, Express.js);· Experience with unit and integration testing of code, with an understanding of JavaScript testingframeworks like Jasmine, Cucumber, Mocha, and Karma;· Experience with Government agencies, 508 compliance, and 508 compliance testing tools such as WAVE &· Familiarity with CSS preprocessors (ex/ Less, SCSS, etc.);· Experience providing REST/SOAP APIs for user interface consumption;· Experience working within an Agile development methodology Scrum;· Comfort with and understanding of version control, continuous integration, and deployment tools.Location: Temporary RemoteSalary: $65,000.00 to $80,000.00 /yearBeaconFire is an e-verified company, and we provide H1B visa sponsorship to all qualified international candidates.Job Type: Full-timePay: $65,000.00 - $80,000.00 per yearBenefits:401(k)Dental insuranceEmployee discountHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceReferral programRelocation assistanceRetirement planVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payEducation:Bachelor's (Preferred)Experience:JavaScript: 1 year (Preferred)Work Location: Remote",
        "title": "newWeb Developer",
        "url": "https://www.indeed.com/viewjob?jk=625801a37c046e83"
    },
    {
        "companyLocation": "Random Lake, WI 53075",
        "companyName": "Bertram Communications",
        "details": "LAMP Developer Headquartered in beautiful Random Lake, WI, Bertram Communications LLC is a family-owned company that provides wireless Internet connectivity across the State of Wisconsin as well as software and hardware products for the ISP industry, government services and beyond. Competitive pay, benefits and a relaxed and fun work environment are just some of the many perks included when working for Bertram.We are looking to hire talented LAMP developers with a focus on backend software development. Intermediate to advanced experience using PHP, *SQL, JavaScript and web application development in general is a must. While this position is primarily for a back-end developer, full-stack knowledge is required.Requirements:* Intermediate to advanced knowledge of PHP, SQL (MySQL or Postgres preferred), JavaScript and web development in general* Strong work ethic* Ability to write coherent, organized code and be comfortable working on a mature, complicated code base ( >2.5 million lines)* Strong Object Oriented Design and architecture skillsJob Type: Full-timePay: $70,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceDisability insuranceHealth insuranceLife insurancePaid time offRetirement planVision insuranceSchedule:8 hour shiftDay shiftMonday to FridayOn callOvertimeCOVID-19 considerations:We are following all CDC guidelines to keep our employees and customers safe.Application Question(s):How many years of PHP experience do you have?Education:High school or equivalent (Preferred)Experience:REST: 3 years (Preferred)Java: 3 years (Preferred)Work Location: One location",
        "title": "Developer",
        "url": "https://www.indeed.com/viewjob?jk=2ac83ec1e838ed9d"
    },
    {
        "companyLocation": "Portland, OR 97220 (Parkrose area)•Remote",
        "companyName": "Leatherman Tool Group Inc.",
        "details": "Leatherman is the world leader in the design and manufacturer of innovative, high quality, compact, multi-purpose tools. We employ over 500 team members in our 90,000 square feet facility. Please visit our website at: www.leatherman.comBe an integral part of Leatherman’s growing ecommerce business. Work closely with Leatherman’s web developers, ecommerce team, creative team, and others to contribute to the creation of amazing web customer experiences. Work in a variety of development roles, from UI programming to complex backend integrations. Additionally, work on a variety of websites including Leatherman’s consumer ecommerce website, international sites, and internal sites.Requires a highly motivated web developer with a desire to learn more about a variety of languages, platforms and technologies including Salesforce Commerce Cloud, JavaScript client and server-side code, Express, Microsoft Azure, Sass/CSS, REST, SOAP, SQL, Node and continuous integration processes.Essential Functions· Lead and participate in code reviews.· Be responsible for building and maintaining automated build processes.· Champion high-quality testing, documentation, and code management practices.· Work with newer developers to increase their skills and to learn how and why we strive to follow industry best practices.· Assist the Ecommerce team in evaluating new technologies and partners.· Take a leadership role on assigned projects and manage them to completion.· Have a thorough knowledge of all systems, vendors and data flows involved with Leatherman Ecommerce.· Be willing to continually learn and incorporate new tools and techniques.· Continue to write code for all aspects of Leatherman ecommerce.· Be an advocate for the protection of our customer’s data; follow all GDPR/CCPA laws and privacy best practices.Qualifications· Minimum 4 years of web development experience in a business environment preferably related to ecommerce or a bachelor’s degree in Computer Science and 2 years’ experience.· Proven experience working with the JavaScript language and development tool sets used for web development.· Experience with Salesforce Commerce Cloud, node and Azure.· Excellent skills in interpersonal relationships, communication, and teamwork.· Excellent verbal and written communication skills; able to establish and maintain effective relationships with various other departments.· Work independently and possess a high level of self-motivation and initiative.· Effectively organize, prioritize, plan, and follow through on multiple complex assignments and projects.Position can be remote, hybrid, or in-office setting based on business need. Employees working remote must be flexible to work in-office as required for work assignments, meetings, etc.We care about the Health and Wellbeing of our EmployeesLeatherman believes having healthy employees contributes to a healthy and productive workplace and community. While we're all responsible for our own overall health and well-being, Leatherman works toward helping employees make healthy lifestyle choices and changes that improve their health and overall quality of life through its many Health and Well being Resources.Medical/dental/visionFree/low cost on-site primary care health center401(k) plan with company matchingLife and disability insuranceFlexible spending and health savings accountsBehavioral health programsPet insuranceOnsite health coachingLifestyle and fitness programsTuition assistanceEmployee volunteer programGenerous employee discountsOnsite fitness centerPaid time offCore ValuesWe thrill our consumers with quality, products and service; We care about each other’s well-being; We share ideas, challenge each other and do the right thing; We respect each other, show humility and grow from our failures; We foster the development of individuals to reach their greatest potential.MissionWe create innovative products that prepare people for the expected and unexpected and result in real tales of triumph.VisionOur vision is to be the global multipurpose brand of choice.Pre-employment background check and drug screening is required. Leatherman Is An Equal Opportunity EmployerJob Type: Full-timePay: $75,000.00 - $100,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programEmployee discountFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceReferral programTuition reimbursementVision insuranceSchedule:Monday to FridayWork Location: One location",
        "title": "newWeb Developer",
        "url": "https://www.indeed.com/viewjob?jk=dc0dcdbf09e8d21e"
    },
    {
        "companyLocation": "Ann Arbor, MI+1 location",
        "companyName": "HealPay",
        "details": "We create web applications to help businesses and consumers navigate taking and making payments online. We're looking for a productive developer with some experience to help us develop our products. You'll be using Rust, Ruby, Javascript, and PostgreSQL. We prioritize excellent customer support - at times you will work with customers to help resolve an issue or understand a feature requirement. If you have the appropriate skills, we'd love for you to do some Linux system administration. We encourage pair programming, to share knowledge across projects and provide mentoring across skill levels. Required Qualifications Experience with at least one high level programming language (C, C++, Python, Ruby, Perl, Java, C#, Lisp, Javascript, etc.) Understanding of basic data structures (arrays, linked lists, trees, queues, stacks, hash maps, etc.) Self motivated with a strong desire to learn 0-3 years of software development experience Desired Qualifications Currently enrolled in a computer science or related degree program Experience with a relational database management system (PostgreSQL, mySQL, SQLite, SQL Server, Oracle, etc.) Experience with version control software (Subversion, Git, Mercurial, etc.) Experience with with HTML and CSS Familiar with online payment processing",
        "title": "Junior Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=84e78087102e5db1"
    },
    {
        "companyLocation": "Milwaukee, WI•Remote",
        "companyName": "MiraclesTek",
        "details": "Title: .NET DeveloperLocation: Remote or Milwaukee, WI / LouisvilleAny Visa: Any visa is fine except H1BW2 or 1099**.NET Developer – 6-12 months with possible extension; must reside in either Milwaukee or Louisville and will by a hybrid (remote/in office) scheduleJob Description: Technical Profile: · Strong back-end development skills with experience in Azure iPaaS and C#· .NET Generalist with strong preference for experience writing/using web services. See above for more detail· Preferred: C#, T-SQL, Web API, Azure iPaaS· Ok to have but not primary: ASP.NET MVC, Batch Scheduling Systems (ex. CA Autosys), Salesforce Development & CI/CD Processes (ex. GOCD)· Strong SQL skills· Experience with Test Driven Development· Exposure to Entity Framework or other ORMCandidate Profile / Qualities needed for this role: · Good communicator who wants to work in a team environment, comfortable performing pair programming· Analytical – not afraid to dive into complex code and data to troubleshoot issues· Creative problem solver who is automation focused – we’re looking to not have recurring work come back to us, but to better automate or teach/train users for self service· Motivated by small quick wins and process improvement· Comfortable working in an agile environment. Prefer experience working in agileJob Types: Full-time, Part-time, ContractPay: $55.00 - $60.00 per hourSchedule:8 hour shiftMonday to FridayAbility to commute/relocate:Milwaukee, WI 98052: Reliably commute or planning to relocate before starting work (Preferred)Education:Master's (Preferred)Experience:AWS: 1 year (Preferred)ASP.NET: 1 year (Preferred)APIs: 1 year (Preferred)Work Location: One location",
        "title": ".Net Developer",
        "url": "https://www.indeed.com/viewjob?jk=2eb5802f718c3524"
    },
    {
        "companyLocation": "Chesapeake, VA 23320 (Greenbrier West area)",
        "companyName": "Dollar Tree",
        "details": "The Front End Developer will take their passion for digital usability, design and web development to create world class experiences for Dollar Tree & Family Dollar customers who interact with the brand via various digital means. The Front End Developer’s main role is to work with various internal and external stakeholders to capture business requirements, visions, and insights and then to transform them into scalable dynamic digital experiences. The Front End Developer will collaborate with both company management as well as with external vendor partners to design and develop these digital and web applications. The Front End Developer will also play a role in developing the knowledge, understanding and underlying skill sets of any Interface Designers/Web Developers working in the Digital Division of Dollar Tree, Inc. Provide technical Leadership for all aspects of Dollar Tree’s Ecommerce sites, Non-Ecommerce sites, Local Store Websites, Call Center application. Work closely with graphic designers to create, schedule and launch various on-site and off-site promotional campaigns (i.e. Content Pages, Banner Ads, and Emails). Work closely and collaboratively with the company’s IS department to ensure all company standards, policies and process requirements are met and maintained. Assist in managing relationships with various technical partners & vendors as needed. Monitor site performance across a variety of metrics (i.e. load time, up-time, performance across browsers, click through pathing, conversion, abandonment, etc.). Perform expert reviews on concepts and wire frames and integrate this into the design process on an iterative basis by presenting the findings and suggesting changes where necessary. Serve as Primary technical contact for partners and vendors in terms of integrations, configurations, maintenance, enhancements, launches and fixes. Accountable for making sound recommendations on the navigation, functionality, organizational structure, page-to-page flow and design of ecommerce and non ecommerce web sites. Translate strategy, business requirements, consumer research findings and usability/design best practices into site design solutions that balance the best user experience while delivering on business goals. Work closely with Dollar Tree Direct Upper Management to ensure auditable systems are in place and maintained to ensure compliance from both a legal and an auditing perspective. Play the Leader’s role in the monitoring, tracking, fixing and testing of enhancements and bug fixes. Support Call Center efforts, looking for process flow improvements made possible by improving Interfaces and Work Flows. Prioritize tasks, meet deadlines, and produce quality work in a fast-paced environment. Pin-point important issues that may require further discovery research. Design user interaction solutions/schematics based on sound usability principles, research and technical feasibility. Express these solutions through design documents. These documents may include architecture-maps, system process flows and thumbnail flows. Minimum Requirements/Qualifications Bachelor's degree in a relevant field (EX: BS – Information Technology) plus a minimum of 3 years of interface design including site development and adaptation for established, consumer facing web sites. A minimum of 3 years of experience in each of the following technologies: HTML/CSS/JavaScript A minimum of 3 years of Web programming/Computer logic experience A minimum of 1 years of experience in XML A minimum of 1 years of front-end technologies (Web Developer Suite) to include Dreamweaver and PhotoShop A minimum if 3 years of experience and proven success in implementing usability testing practices and then implementing deliverables based of those outputs A thorough and deep intellectual understanding of common web and interface conventions, as well as dynamic, data-driven web sites. Strong understanding of various Web browser platforms (Firefox, Chrome, Safari, Internet Explorer), and the impact/variations they can have on such things as usability, load times, and renderings A proven track record of Project Management is necessary as is the ability to play roles in multiple projects in a fast paced environment with a focus on delivery world class outputs/deliverables Must be able to translate business strategies into conceptual diagrams, task flows, and site maps A strong working knowledge SEO best practices as well as experience in SEO analytics Knowledge and understanding of the importance of marketing and online branding Detail oriented with excellent organization, analytical, technical writing and problem-solving skills. Must be fully vaccinated from COVID-19, as defined by the CDC, by the date of hire. Proof of vaccination required. Request for medical or religious accommodation must be made prior to the start date Desired Qualifications Strong understanding and track record of coding to WAG and ADA Accessibility standards ",
        "title": "FRONT END WEB DEVELOPER",
        "url": "https://www.indeed.com/viewjob?jk=e964342415b30f16"
    },
    {
        "companyLocation": "Washington, DC",
        "companyName": "Antra, Inc",
        "details": "Entry-Level React DeveloperIn this role as React Developer, you will developing solutions to achieve business needs and will be involved in all aspects of the software development lifecycle including technical design, implementation, testing, deployment and support of cutting-edge applications.Responsibilities: Provide value by integrating business rules and content in accordance with requirementsWork closely with Product Owners, Analysts and QA in an Agile environment to ensure quality, security and maintenance of applications, and to ensure code meets development standards and guidelinesSupport design, development, testing and deployment of software solutions using Javascript/Typescript and Angular Framework for the client-side development and using Java and Spring Framework to develop the server-side business logic of the applicationDevelop, document, and advocate SOLID software architecture practicesContribute to a DevOps culture and development of continuous integration processes and toolsAbility to jump between frontend and backend workAdhering to established methodologies while continuously analyzing processes for improved performance and adaptabilityContribute to the success of your team and companyResponsible for coding, testing, and implementation of solutions within established standards and documentation guidelinesJob Requirements: Graduate degree or undergraduate degree in Computer Science, Computer Engineering, Information Technology, Information Systems, Software Development, Electrical and Computer Engineering, Electrical Engineering or relevant experience0-3 years of software development with knowledge of software development life cycleKnowledge of Object Oriented Programming with some experience in any OOP programming languages like JavaKnowledge on fundamentals of HTML, CSS and JavascriptKnowledge of web services with JSON and REST, SOAP/XML is a plus.Knowledge of any frameworks such as NodeJS, Angular or ReactJS is a plus.Knowledge on Javascript ES6 features such as classes, arrow functions, string templates, rest/spread operators, promises, async/await is plusExperience with designing and developing RESTful web services is a plusBe a self-starter with an ability to troubleshoot and seek answers to problemsHave hands-on design and development of software applications/systemsProven analytical skills with excellent oral and written communication skillsMust be authorized to work lawfully in the United States (OPT/CPT is acceptable)Willing to relocate to any US location on Antra projects locationThe intent of this position description is to provide a representative summary of the major duties and responsibilities performed by incumbent(s) in this position. Incumbent(s) may not be required to perform all duties in this description and incumbent(s) may be required to perform position-related tasks other than those specifically listed in this description.Antra Inc. is an equal opportunity employer, providing equal employment opportunities (EEO). All employees and applicants for employment will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or expression, pregnancy, protected veteran status or other status protected by law. This policy applies to all terms and conditions of employment.Job Types: Full-time, ContractPay: $65,000.00 - $75,000.00 per yearBenefits:401(k)Dental insuranceHealth insurancePaid time offParental leaveProfessional development assistanceReferral programRelocation assistanceVision insuranceSchedule:Monday to FridayAbility to commute/relocate:Washington, DC: Reliably commute or planning to relocate before starting work (Preferred)Education:Bachelor's (Preferred)Work Location: Multiple Locations",
        "title": "newEntry-Level React Front End Developer",
        "url": "https://www.indeed.com/viewjob?jk=58e4a4b5d9166be9"
    },
    {
        "companyLocation": "Baltimore, MD 21201 (Downtown area)",
        "companyName": "Johns Hopkins Health System",
        "details": "Web Developer Front End Requisition #: 450964 Location: Johns Hopkins Health System, Baltimore, MD 21201 Category: Non-Clinical Professional Work Shift: Day Shift Work Week: Full Time Weekend Work Required: No Date Posted: Dec. 21, 2021 Join an amazing global healthcare organization! Excellent compensation package! Awesome benefits, including dependent tuition reimbursement! Requisition #: 450964 Location: 901 S. Bond Street, Baltimore, MD 21231 Shift: Full Time (40 hours) Day Shift, 8:30 am - 5:00 pm Exempt Position Summary: Working under the direction of the Director, Strategic Web Development and Services, the Web Developer will be responsible for assisting with the presentation of web designs, design support within HTML, building HTML templates within various CMS systems, and providing front-end website development support for the application development team. The position includes mobile-first web development, responsive design, and WCAG 2.1 AA accessibility compliance for www.HopkinsMedicine.org. Ensures successful and timely Web development to support overall mobile-first strategy including related modules, internal and external databases, and applications. Utilizes the latest web development technologies, including SASS, Git, and module bundlers such as webpack and gulp.js. Researches, develops and/or coordinates new technologies in support of asset hosting, social media integration, and animations, videos, and other media. Maintains assets within the HopkinsMedicine.org content management system (CMS) and supports the development of new templates, modules, and all aspects of infrastructure. Ensures security of Web sites and related applications, performs periodic Web site audits; monitors and reports on Web site performance, and actively works to improve overall site performance. Advises on/manages technical issues and contributes to the development and maintenance of the overall information architecture and taxonomies of the JHM site(s). Works with web team and other institutional web leaders to establish Johns Hopkins Medicine Web standards, guidelines, and policies. Supports training on topics related to the CMS, as well as on Web accessibility/usability standards. Education: Bachelor' degree required - Equivalent experience beyond the work experience requirement may be substituted on a 2:1 basis. Work Experience: Demonstrated experience and competency areas should include the following: HTML5, JavaScript, jQuery, and advanced CSS, including the ability to write W3C-validated markup that supports both desktop and mobile environments. Successful candidate will have experience with SASS, Git, and module bundlers such as webpack or gulp.js. The successful candidate will have designed and integrated templates in a variety of CMS systems. Candidate should have knowledge of or worked with various programming languages such as ASP.NET, ColdFusion, PHP, or C#, or other object-oriented languages. Demonstrated design proficiency, and experience with design tools such as the Adobe product suite and the ability to convert flat designs to HTML/CSS. Additionally, the candidate should demonstrate experience in the following competency areas including: Familiarity with Google APIsProven understanding of W3C and WCAG 2.1 Web standards and of online security standards and methods;Familiarity with developing and managing web sites within a Content Management System. Experience with design-related tools including Adobe Photoshop and Illustrator.Ability to conduct research into emerging Internet technologies and programming languages.Ability to research, organize, and present ideas in business-friendly and user-friendly language.Ability to prioritize and execute tasks in a high-pressure environment.Ability to organize, manage, and work within a team-oriented, collaborative environment.The successful candidate will be able to navigate, negotiate, and accommodate the needs of a diverse community. Must be able to communicate effectively to a non-technical audience.Strong verbal and written communication skills.Strong customer and interpersonal/human relations service skills. Knowledge/Skills: Proven, relevant experience in cross-functional development with a broad range of Web technologies. Working knowledge of Web server technology and the ability to make appropriate hardware and software recommendations. Strong knowledge of Web strategies, technologies, protocols, and tools. Strong knowledge and understanding of various Internet programming languages, analytics and trends. Knowledge and understanding of application development methodologies. Working knowledge of structuring, developing, and implementing interactive Web sites. Knowledge of database development. Knowledge of data privacy practices and laws. Web accessibility expertise. Johns Hopkins Health System and its affiliates are an Equal Opportunity / Affirmative Action employers. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity and expression, age, national origin, mental or physical disability, genetic information, veteran status, or any other status protected by federal, state, or local law. Johns Hopkins Health System and its affiliates are drug-free workplace employers.",
        "title": "newWeb Developer Front End",
        "url": "https://www.indeed.com/viewjob?jk=0c78b3481a5f1be0"
    },
    {
        "companyLocation": "Piney Flats, TN",
        "companyName": "Business Information Systems",
        "details": "Independent. Innovative. Growing. These are the words that not only define our company but also our team. Our employees share a commitment to teamwork and are dedicated to our continued growth and success. BIS is looking for talented individuals who thrive in a dynamic, growth-oriented environment. Join our team of skilled and passionate people just like you.As an Entry Level Web Developer for BIS.You will: Develop, test, implement, and maintain web applications.Diagnose and resolve reported problems and issues.Look for and make recommendations to improve applications and processes.Participate in daily standups and team meetings.You should have: Graduate-level knowledge of HTML, CSS, SQL, and PHP or JavaScript.A strong work ethic and a willingness to learn.Good critical thinking and problem-solving skills.Excellent written and verbal communication skills.The ability to set goals and meet deadlines.Benefits: Health Insurance.Dental Insurance.Vision Insurance.Life Insurance.Disability Insurance.401(k) Plan.Paid Time Off.Work Location: Piney Flats, TN (This is not a remote hire position)About Business Information Systems: Business Information Systems (BIS) is a data systems design partnership company founded in 1977 to help businesses and municipalities find solutions by using the latest computer technology and programming techniques.Now, over 40 years later, we are continuing to expand and grow. In addition to the numerous solutions we offer, we have expanded our development to offer robust custom statewide motor vehicle solutions to meet the needs of any state.We employ over 125+ team members and continue to meet the needs of over 300+ government entities and commercial customers throughout the states of Tennessee, North Carolina, South Carolina, Kentucky, Arkansas, and Virginia.We are proud to provide 100% complete customer satisfaction and our business volume has continued to grow over the years as a result.Job Type: Full-time",
        "title": "newWeb Developer",
        "url": "https://www.indeed.com/viewjob?jk=47f78a86ab9e898b"
    },
    {
        "companyLocation": "San Diego, CA+1 location",
        "companyName": "1POINT21 Interactive",
        "details": "We are currently looking for Jr. Web Developers who are passionate, innovative and motivated to make a difference. Responsibilities include: The developer’s primary focus will be to assist the development team in developing WordPress sites, testing, deployment, and site updates. Utilize HTML / CSS to troubleshoot and edit issues and updates to sites through the production lifecycle. Continue to learn best practices for developing responsive websites and WordPress themes. Desired Skills & Experience: Ability to communicate and work in a team environment. Must have experience working with WordPress Organizational skills, work management, ability to prioritize, identify, and resolve issues. Qualifications: Thorough knowledge of HTML(5), CSS(3), WordPress Solid understanding of responsive design and development practices Experience in web development industry Knowledge of cross-browser testing and common issues. Ability to use Photoshop. Company Perks: Bonuses Incredible company culture with laid-back atmosphere Company events throughout the year Work with a great team of people Full benefits package including medical, vision, dental and 401K",
        "title": "Jr. Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=820ac2e5d77aa573"
    },
    {
        "companyLocation": "Seattle, WA 98119 (Uptown area)",
        "companyName": "Razorfish",
        "details": "Company Description Hi there! We’re Razorfish. We’ve been leading the marketing industry with our digital expertise since the start of the internet. But in 2020, we did a full reboot. What’s different? It all starts with people. Weird, wonderful, complex people -with diverse backgrounds in strategy, creative and technology. But no matter how different we are, we all have one thing in common. We believe our differences are our strength. So we push for inclusion, challenge convention and bring in new perspectives, to inspire new ideas. Because when we connect by understanding what makes people different, we can create unforgettable experiences that enrich lives. Join us at razorfish.com. Job Description PLEASE NOTE: This is NOT a remote position and all candidates must be local to Seattle to receive consideration. Some onsite work at our lab in Seattle will be required. Razorfish is looking for a Developer... but not just ANY Developer. We are looking for someone who spent their college days behind the desk at the Apple Genius Bar or driving around one of those snazzy Geek Squad vans. Someone whose weekends are filled with tweaking their personal laptop, developing video games with friends, or building and optimizing their personal Raspberry Pi server. Someone with a natural curiosity who loves solving puzzles and is passionate about all things tech. Professionally, you are fundamentally a Developer. You lean towards the front-end side because you are naturally creative and love building things that people actually interact with but you also have an understanding of what is going on behind the scenes and may even know some .NET or Node. You know JavaScript and have worked in frameworks like React and Ember, but you're also interested in modern technologies like AR/VR and AWS Cloud; you have maybe even dabbled in tools like Unity and Unreal Engine. You love collaborating, ideating, and learning and you're constantly pushing yourself to expand your knowledge of all things tech, both at work and at home. Your dream job would be to spend 75% of the day coding and developing modern, stylish customer-facing interactive experiences and the other 25% playing around under the hood of computers and related hardware, installing, upgrading, configuring, and tinkering. This is a growth role so the core skillset can be flexible... but a drive, passion, and love for technology is not. If that all sounds like you, then let's talk. Qualifications Associate's or Bachelor's Degree in Computer Science, graduation from a relevant bootcamp, or equivalent experience/certifications 6+ months of prior professional development experience Side passion projects or prior jobs in the tech space (developing video games, working on a tech support team, building websites, blogging about technology, etc.) Experience developing using modern JavaScript frameworks such as React or Ember Familiarity or experience with Node, .NET, or other backend languages Familiarity with AWS and other cloud technologies as well as a basic understanding on setup and configuration Experience troubleshooting, updating, installing, and repairing computers, servers, cameras, displays, LEDs, and related hardware and peripherals Extraordinary attention to detail Excellent communication skills and a love of collaboration Passion for technology, a natural curiosity, and a love of problem-solving A desire to learn, grow, and be mentored Additional Information As part of our dedication to an inclusive and diverse workforce, Sapient Corporation is committed to Equal Employment Opportunity without regard for race, color, national origin, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity, or religion. We are also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at hiring@publicissapient.com or you may call us at +1-617-621-0200.",
        "title": "Jr. Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=08671ca74c993dd8"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Continuum",
        "details": "APPLY NOWWEB DEVELOPERABOUT THE POSITIONThis Web Developer owns the HTML development and last mile delivery of non-promotional email for our client and sits at the intersection of Commerce, Payments, CRM, and Growth Marketing.LOCATIONRemote, USAYOUR JOB WILL INCLUDEThe Web Developer only supports our clients \"Transactional\" emails: emails that communicate critical activities about a specific user action or eventExamples include emails about purchase-related transactions (ex: invoices and shipping confirmations), failure notices (ex: a notification about a credit card decline), and information about approvals and privacy violationsYOUR BACKGROUND INCLUDESHTMLJAVALINUXBuganizerCider [integrations to Piper, Critique, Blaze]GammaRedwood [Connect Composer]Translation ConsoleWHAT WE OFFERContinuum is an Equal Opportunity EmployerWe have a strong commitment to being a welcoming environment for candidates and employees and one that appreciates and maximizes the talents of all employeesWe value our employees’ different backgrounds including differences in gender, race or ethnicity, sexual orientation, religion and politics, nationality, age, and socioeconomic statusJob Type: Full-time",
        "title": "Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=f2c0119e81e9b419"
    },
    {
        "companyLocation": "Remote",
        "companyName": "By the Pixel",
        "details": "By the Pixel is seeking a talented and passionate full-time Junior Web Developer to join our growing team! If you love creating modern, immersive UI experiences and enjoy a casual but fast-paced work environment, this role is for you.By the Pixel is a small but mighty digital agency based out of Denver, Colorado, with remote employees across the country. We specialize in high-end and enterprise web application design and development, supporting our clients end-to-end by creating full-service solutions. Our services include design, custom web development, hosting services, tired production support, search engine optimization, paid advertising, content marketing, and more. We pride ourselves in being a trusted partner to our clients, focusing on open communication, attention to detail, and strategic solutions.Skills needed for the job: HTML/HTML5CSS/CSS3/SASSJavascript/TypescriptVueJSRuby on RailsBonus skills: PHPLaravelAngularAWS ProductsDevopsGithub ActionsRequirements: Two years experience as junior web developer working with javascript and ruby and/or php projectsYou must be the person applying for the job - so please - no staffing agencies or recruitersWhat we can offer you: Competitive base salaryPosition with a fast growing, dynamic companyCulture of learning and collaborationOverall flexibilityHealth, Dental & Vision BenefitsRetirement matchPaid vacationPaid holidaysAt By the Pixel, we like to take on challenges and tackle big problems as a team. You’ll find an exciting and supportive environment where you can grow your skills. Your work schedule will be flexible and your office can be remote. We believe in supporting our employees on and off the clock, so you’ll enjoy a full benefits package.Job Types: Full-time, InternshipPay: $50,000.00 - $80,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offParental leaveVision insuranceSchedule:8 hour shiftMonday to FridaySupplemental Pay:Bonus payCommission payApplication Question(s):Why do you want to work for By the Pixel?Education:High school or equivalent (Preferred)Experience:Ruby on Rails: 2 years (Preferred)VueJS: 2 years (Preferred)Laravel: 2 years (Preferred)Work Location:Fully RemoteWork Location: Remote",
        "title": "Junior Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=92343f459a8aa675"
    },
    {
        "companyLocation": "Pittsburgh, PA 15275",
        "companyName": "Transport Investments",
        "details": "Junior Web DeveloperPurpose: The Junior Web Developer is responsible for designing, creating, and modifying web applications used throughout the organization. This individual will work closely with IT and business leaders to deliver enhancements and improve efficiencies and the overall user experience.Reports To: Software ArchitectEssential Responsibilities:Work closely with leadership and end users on application requirements, testing, and delivery of applications.Learn, train and implement new end-user experiences using various technologies.Stay abreast with concepts and best practices for application design.Maintain clear and concise documentation to support developed technologies.Write code that is both sustainable and scalable.Lead and perform application testing exercises both individually and as part of a group.Contribute to the development of project schedules and workflows.Recommend changes and enhancements to applications.Research UI/UX trends and integrate concept into applications.Support the entire application development lifecycle.Position Requirements:Bachelor’s degree in Computer Science or a relevant field.Desire to learn and write code in JAVA, JS, CSS, JQUERY, XML, JSON, COLDFUSION, and SQL languages.Basic knowledge of UX and UI concepts with understanding that goal is become highly skilled at UX/UI design in web applications.Familiarity with OOP design principles.Familiarity of IT security concepts and/or ability to learn integrating them into application technologies.Ability to work well with various personality types.Creative and innovative approach to solutions.Strong verbal and written communication skills.Ability to work in a fast-paced and dynamic environment.Excellent analytical skills with a strong problem-solving mentality.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offReferral programVision insuranceSchedule:Day shiftMonday to FridayAbility to commute/relocate:Pittsburgh, PA 15275: Reliably commute or planning to relocate before starting work (Preferred)Application Question(s):What are your minimum salary requirements?Education:High school or equivalent (Preferred)Experience:Front-end development: 1 year (Preferred)CSS: 1 year (Preferred)Angular: 1 year (Preferred)Work Location: One location",
        "title": "Jr. Web Developer",
        "url": "https://www.indeed.com/viewjob?jk=50c1b7acc44676a4"
    },
    {
        "companyLocation": "Knoxville, TN 37902 (Downtown area)",
        "companyName": "Moxley Carmichael",
        "details": "Working with internal and external stakeholders, the Web Developer will determine client needs, perform research and make recommendations, then design, build, optimize and maintain websites and other digital properties.The Web Developer reports to the Senior Web Developer.Responsibilities· Works with internal account team and external clients to design, build, optimize and maintain digital properties.· Performs both front-end and back-end digital property development (full stack), including working with clients during planning, building user-friendly and optimized properties, providing client training and handling back-end maintenance.· Researches and stays abreast of current platforms, technology trends and emerging technology.· Dissects analytics to provide useful reports to clients and to determine strategy for development, edits or additional changes.· Maintains back-end functions for client websites, performs routine patches, version and security updates and makes clients edits as needed.· Utilizes time management to plan daily workflow against deadlines.· Participates in client training for new digital properties and processes and for other pertinent technology content.· Assists clients in resolving issues by responding to inquiries in a timely and professional manner.· Troubleshoots issues, debugs client websites and provides updated documentation to client.· Acts as a steward for both firm and client resources.· Communicates progress regularly to both internal customers and external clients.· Builds the Moxley Carmichael brand by providing value and outstanding service to clients and potential clients.· Performs other job-related duties as assigned.Required Skills· Demonstrated experience and/or thorough understanding of full stack web development and preferred technology platforms.· Strong listening, research, analytical and reporting skills.· Excellent written and verbal communication skills.· Ability to be self-directed and resourceful.· Ability to delegate to support staff.· Ability to handle pressure, multi-task and work under tight deadlines on numerous projects.Preferred Technology HTML & CSSPHPJavascriptWordPressLinuxServer Query Language (SQL)Application Programming Interface (API)Content Delivery Network (CDN)DNS (Domain Name System)Linux based cloud hosting***THIS JOB IS LOCATED IN KNOXVILLE, TENNESSEE. APPLICANTS MUST BE IN KNOXVILLE OR MOVING TO KNOXVILLE IN ORDER TO BE CONSIDERED.***Job Type: Full-timePay: $40,000.00 - $70,000.00 per yearBenefits:401(k)Dental insuranceHealth insuranceLife insurancePaid time offRetirement planVision insuranceSchedule:Monday to FridayCOVID-19 considerations:Social distancing guidelines in placeVirtual meetingsSanitizing, disinfecting, or cleaning procedures in placeWork Location: One location",
        "title": "newWeb Developer",
        "url": "https://www.indeed.com/viewjob?jk=9867f599d3517e09"
    },
    {
        "companyLocation": "Voorhees, NJ 08043+1 location",
        "companyName": "Advocare Pain",
        "details": "About Advocare Pain: Immediate openingMedical Business in south jersey and Philadelphia seeks web designer candidates who are professional, positive, organized & efficient with attention to detail & good communication skills.Excellent salary and compensation based on experience and talents.Job Types: Full-time, Part-time, Contract, Temporary, InternshipPay: $12.00 - $20.00 per hourSchedule:Day shiftMonday to FridayWork Location:One locationWork Remotely:NoWork Location: One location",
        "title": "Web Designer/Developer",
        "url": "https://www.indeed.com/viewjob?jk=1c75d58c84ea89d2"
    }
]