[
    {
        "companyLocation": "+1 locationRemote",
        "companyName": "Hackbright Academy",
        "details": "As a Python Software Engineering Teaching Assistant, you will be instrumental in teaching and guiding students through their learning experience. You will be expected to work closely with individuals and teams to review, critique, and help with project work. The Teaching Assistant will also ensure that students understand what they should be working on, accomplishing their project goals, and are understanding concepts taught in the curriculum. The Teaching Assistant will guide project work and be proactive in assisting students. Essential Duties & Responsibilities: Collaborate with your leader on curriculum content and instruction May be asked to deliver and facilitate course content Lead in-class exercises, project time, and participate in lecture discussions Work with individual students on projects to ensure quality and that the correct principles are being learned and applied Participate in regular student reviews and critiques Inspire students to move through the challenges of learning a new skill set. Work alongside the other instructional staff to best meet the needs and learning styles of students Work with Assistant Instructors and Instructors to provide students with meaningful and prompt feedback on their progress Job Skills: Is a proactive communicator, strives to be articulate in their speech towards students Proficient in basic computer skills Proficient in program-specific languages and technologies Able to learn on the fly Work Experience: This is entry-level position Education: Self-taught developer, Bootcamp graduate, or equivalent degree Other: Remote work Access information using a computer. Effectively communicate, both up and down the management chain. Effectively cope with stressful situations Strong mental acuity Regular, dependable attendance and punctuality are essential functions of this job. Other essential functions and marginal job functions are subject to modification. If you require a reasonable accommodation to complete our application process, please contact our Human Resources Department at Careers@strategiced.com.",
        "title": "Python Software Engineering Teaching Assistant (Part-Time)",
        "url": "https://www.indeed.com/viewjob?jk=cc10e115d1ed386e"
    },
    {
        "companyLocation": "Remote",
        "companyName": "TechData Service Company, LLC",
        "details": "Knowledge of CI/CD and automated pipelines. Hands on experience with any CI/CD toolCDISC knowledge plusHas the following software skills:Object Oriented Programming (Python must, Java, c# plus)Expert command over python packages: fastapi, flask, pydantic, jinja, pandasTemplating Languages (Jinja2 must, Thymeleaf plus)Databases - Relational must, Graph databases (plus)People with cypher knowledge are hard to find but it;s not too hard to pick upUI: Virtual DOM frameworks such as VueJS, Angular or React are a plusJob Types: Full-time, ContractPay: $60.00 - $75.00 per hourBenefits:Dental insuranceHealth insuranceVision insuranceSchedule:Monday to FridayWork Location: Remote",
        "title": "Python Developer (Remote)",
        "url": "https://www.indeed.com/viewjob?jk=5e691669b1f4998c"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Live Building Systems",
        "details": "Live Building Systems is a cloud based, cross-platform technology to track utility consumption and building efficiency. This smart monitoring system analyzes and diagnoses inefficiency in real time, providing solutions to reduce waste and save money.We are currently in search of a Junior Software Developer to create and maintain software and network systems. The right candidate is someone who is capable of helping develop critical products for our clients, on top of offering excellent technical support for our existing infrastructure.This will involve using pre-existing tools to analyze data and compiling findings into an easily digestible format, as well as the creation of new tools to further increase customer’s understanding of their consumption across a variety of different utilities.This is an excellent opportunity for a motivated and inquisitive junior level developer or analyst who is looking to not just maintain existing software, but also create new features and products from the ground up.What you will do at LBS: Collaborate on design, then code, test, support, and run the systems you create with our in house development teamConstantly participate in identifying and implement effective improvements to our software development process.Innovate creative solutions to difficult problems while honing your technical skills and learning new technologiesUtilize proprietary software to troubleshoot installed hardwareAd-hoc duties, as neededRequirements: Bachelor’s Degree in Computer Science or related fieldExperience in web and software developmentExperience with data analyticsDemonstrated knowledge of web technologies including HTML5, CSS3 and JavascriptDemonstrated knowledge of PythonExcellent software development, design, and documentation skills. You aim to create software that works reliably and can be tested and maintained.Ability to work independently and multi-task effectivelyStrong attention to detailJob Type: Full-timePay: From $57,185.00 per yearBenefits:401(k)Dental insuranceHealth insuranceHealth savings accountLife insuranceVision insuranceSchedule:Monday to FridayEducation:Bachelor's (Preferred)Experience:REST: 1 year (Preferred)Java: 1 year (Preferred)Work Location: Remote",
        "title": "Junior Software Developer",
        "url": "https://www.indeed.com/viewjob?jk=343d498f0970f1f7"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Denken Solutions Inc",
        "details": "Currently, we are looking for talented resources for one of our listed clients. If interested please reply to me with your updated resume or feel free to reach out to me for more details at . Title: Python Developer Location: Remote Duration: Full Time Job Description: Bachelor's Degree in Computer Science or in \"STEM\" Majors (Science, Technology, Engineering, and Math) Minimum 5 years of professional experience with software development using Python Hands-on experience in developing REST APIs Good to have experience with Cloud like AWS Sound knowledge of OOAnalysis & Design. Strong debugging and unit testing skills using a well-known and accepted unit testing framework Understanding of code versioning tools like Gitlab/GitHub and CI/CT/CD processes using Jenkins Able to work under minimal supervision and be self-directed. Able to work with global team members including time-zone flexibility",
        "title": "Python Developer (100% Remote)",
        "url": "https://www.indeed.com/viewjob?jk=50247303a7c7f7c8"
    },
    {
        "companyLocation": "Milwaukee, WI",
        "companyName": "OhmzTech",
        "details": "OhmzTech, Inc is looking for talented and creative web developers with a wide variety of both front-end and back-end knowledge. Candidates must be able to work from the Milwaukee, WI area for the first six months. This individual should be skilled in rapid development of web-based platforms, including mobile oriented projects. Individuals should have at least some knowledge of all aspects of web development, from webserver management all the way through finalized client deployment. Requirements: Expert at writing and deploying HTML solutions with an emphasis on single-page applications Advanced knowledge of CSS, including browser oddities, and preprocessors such as SASS/LESS Expert in writing and understanding Javascript solutions, able to adapt to different toolkits and methods Highly skilled in database management and deployment using PHP/python/mySQL Understanding and willingness to utilize agile development workflow and platforms Education: Associates Degree or equivalent from a 2-year college or technical school, or 2 to 4 years related experience and/or training. Compensation: OhmzTech, Inc offers competitive wages depending on level of experience and ability to spearhead projects efficiently and quickly. All full-time employees are entitled to benefits such as paid-time off and health/dental insurance. Flexible schedules, including part-time and remote hours, are always available. If you are interested in learning more or applying please contact us",
        "title": "Web Developer Milwaukee",
        "url": "https://www.indeed.com/viewjob?jk=e2256674a81e4cd8"
    },
    {
        "companyLocation": "Remote",
        "companyName": "WhirlWind Technologies, LLC",
        "details": "Job Title/Level IT Software Developer / Task LeadLocation Suitland, MD or RemoteSchedule Full-TimePreferred Clearance Public Trust Clearance (or ability to attain it)Covid Vaccination As a condition of employment, employees will be required to provide proof of their COVID-19 vaccination.Company Overview WhirlWind is on a mission to help each client succeed by using our management consulting and technology expertise. We design, build, and manage secure environments that support data-driven decision making and data-powered products. Our services transform governments and enhance the lives of citizens.Our people are driven and committed to our mission. If you want to join a team of rock stars who do incredible, purposeful work, and have fun doing it, come thrive with us and be one of the heroes behind our success. We offer an attractive benefits package including a competitive base salary and have been voted the Best Place to Work for 2021.Position Overview WhirlWind Technologies, LLC has an immediate opening for a Software Developer / Task Lead in the areas of Machine Learning and Data Science in Suitland, MD or Remote. The successful candidate will be the key contributor to machine learning/data science projects, using multiple tools in support of diverse, research-driven project teams across the enterprise. Our client uses modern machine learning/data science technologies and frameworks, and candidates should have had exposure to the modern machine learning stack. The ideal candidate is a multidisciplinary developer or modeler who has strong abilities to quickly assess and address problems across domains, to approach complex problems creatively, to lead or guide all levels of the team to include customers skillfully, and to devise the delivery of thoughtful solutions. This position will report directly to the Program Oversight Manager.Top 3 Outcomes in Year 1 1 | PageAchieve on-time or early completion of tasks and deliverable submissionsBuild new and strengthen existing stakeholder relationshipsIdentify key issues for the client and propose innovative solutionsEssential Duties & Responsibilities Research applications being used to analyze and visualize data and drive decisionsManage and lead a team of interns (or other project teammates) to market newly developed programs for use within the statistical systemFormally develop presentations for approval at all levels of leadership, and have the ability to retain project funding (if needed) with a creative energyCommunicate technical work to both technical and non-technical audiencesManage the scope and take ownership of large, ambiguous, high-impact projects through stewardship often involving multiple cross-functional team membersApply or develop new machine learning and data science methods to large-scale data problems by keeping current with important developments in machine learning, data science, and/or statistics research or practice communitiesFollow and improve established processes for software development life cycle with an Agile approach to delivery softwareDevelop software design approaches using highly collaborative and interactive methods such as surveys throughout the SDLC to implement program-level and functional requirementsIdentify and conduct appropriate use cases and unit tests according to Agile methodsFacilitate impediment resolution in a timely, cost-effective mannerPerform other duties as needed or requiredRequired Qualifications Public Trust Clearance (or ability to attain it)Experience managing, implementing, and architecting software systems using Agile methodologyWorking knowledge of statistical conceptsAbility to work in a rapid paced environment, with a desire to make significant impacts and to learn and apply new technologiesProfessional attitude, with a strong self-directed work ethic and the ability to work in a fast- paced, dynamic environmentSolid communication skills, both verbal and written2 | PageSuperior service ethic and grace under pressureResourcefulness and ability to work proactively and independentlyOutstanding record of achievement in current/past positionsCollegial and dedicated to the success of the teamAbility to read, understand, and create design documentationAbility to learn and use new technologies and frameworksCritical thinker with the ability to troubleshoot and find solutionsExperience with one or more modern programming languages (e.g., Python, Scala, JavaScript, etc.)Fluency with one or more modern machine learning libraries and frameworks (scikit-learn,TensorFlow, etc.)Appetite for hard problemsCore understanding of the end-to-end machine learning pipelineAn understanding or willingness to learn about fair and ethical machine learning best practicesFamiliarity with development tools such as Eclipse, JDeveloper, Visual Studio and SQL DeveloperPreferred Qualifications Bachelor’s degree in Computer Science or Computer Engineering, or relevant experience5 years as a developer, machine learning engineering, or data scientist, preferably with experience using modern programming languagesExperience in building and enhancing software applications, with a preferred focus on supporting big data processing, in large-scale data analysis, and/or in modellingExperience with ticket tracking software (e.g., JIRA, Trello, etc.)Experience with Agile methodologies3 | PageJob Type: Full-timePay: $145,000.00 - $165,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible scheduleFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offParental leaveReferral programRetirement planTuition reimbursementVision insuranceSchedule:8 hour shiftMonday to FridaySupplemental Pay:Signing bonusCOVID-19 considerations:As a condition of employment, employees will be required to provide proof of their COVID-19 vaccination.Education:Bachelor's (Preferred)Work Location: Remote",
        "title": "newIT Software Developer",
        "url": "https://www.indeed.com/viewjob?jk=5ba27c5bf541c39e"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Inorsa Inc.",
        "details": "Inorsa is a tech company taking the engineering world by storm by offering automation and management tools this market has never seen before to help our clients build communication infrastructure better, safer, and faster. We are a small team and therefore the day to day responsibilities can be wide ranging depending on the needs of the company. Given this, collaboration and communication skills are key.We are looking for a Backend Engineer that also has experience in automation. We are creating an enterprise web application that will be the central hub for infrastructure engineering and also host the communication between clients. We are looking for another member of the team to help in the process of implementation from an established design. The work will focus on backend work for our web portal and internal applications as well as making automation tools for engineers. Ideally we are looking for someone with experience with Typescript, Next.js, and relational databases (PostgreSQL specifically). However, anybody with experience in a similar stack that is willing to learn in a fast paced environment is welcome to apply.In addition to the web application, the cutting edge technology Inorsa is pioneering is the complete automation of creating infrastructure related output based on inputs from clients. We are also looking for someone who is able to assist in this project so having experience in programmatic generation/manipulation of PDF/DXF documents using Python is ideal. However, anybody with 2+ years of work experience with Python is welcome to apply.Responsibilities:Collaborate with engineers, product managers, and designers to build out a web applicationUnderstand the user and be able to put yourself in their shoes to evolve the productContinually improve the technology stack and process to keep us using relevant technologiesResearch and develop parts of the automation flow for generation of structural drawings under mentorship if neededWe are looking for:Motivated individuals who can think as a user after taking the time to understand themSomeone who feels a strong sense of ownership for their work and product to continually want to improve it over timeOpportunistic thinkers who can prioritize a good opportunity when they show up and communicate that to management rather than strictly following the plans at all timesTechnically flexible when given a problem so can work across many different tech stacks as our needs evolve over time as we growSomeone who can work on their own when needed and communicate progress efficientlyRequirements:BS or MS in Computer Science or a related field2+ years of work experience in the following technologies: Typescript, Next.js (or similar frameworks), PostgreSQL (or other SQL relational databases), PythonExperience in automation with Python specifically in generating PDF/DXF files is a big plusExperience with AWS is a big plusExcellent communication and collaboration skillsPerks & Benefits:Excellent Healthcare + Dental + Vision benefitsUnlimited PTOFew meetings for engineers + No meeting days for focus timeFlexible work from home policyFlexible working hours (We only care that things are getting done on schedule)Modern technology stackAn exceptional, high performing team you will be excited to work withYour compensation will include meaningful equity ownership.Job Type: Full-timePay: $81,397.00 - $150,000.00 per yearBenefits:Dental insuranceFlexible scheduleHealth insuranceHealth savings accountPaid time offProfessional development assistanceVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payEducation:Bachelor's (Preferred)Experience:AWS: 1 year (Preferred)ASP.NET: 1 year (Preferred)APIs: 1 year (Preferred)Work Location: Remote",
        "title": "Backend Developer",
        "url": "https://www.indeed.com/viewjob?jk=b8b677f647c102a4"
    },
    {
        "companyLocation": "New York, NY 10022 (Midtown area)",
        "companyName": "GTS",
        "details": "Overview: We are a technology driven firm looking for talented junior level Python software developers with a passion for solving complex problems to join GTS. You will have the opportunity to work on a high-volume data processing solution, perform daily analysis of the firm’s trading activities across all asset classes, work on our firmwide trading infrastructure, and process automation. You will work alongside a very experienced team to develop and own our suite of data engineering tools crunching millions of records per-day to analyze the firm-wide financial performance and develop our global trading infrastructure.Responsibilities:*Strong practical knowledge of Python coding skillsHands-on database experience, specifically experience using SQLAptitude towards numerical data manipulation and analysisA bachelor’s degree in computer science, engineering, or related field1-3 years of related work experience; internship experience countsAbility to communicate clearly and concisely, verbally and in writingDesire to take ownership and work autonomously while being part of a close-knit teamQualifications:*The following experience/attributions are a plus**Exposure to (or desire to learn) C++Demonstrated experience operating in a Linux environmentVisa sponsorship available for the right candidate.We invest heavily in our technology and infrastructure, and our flat collaborative and collegiate structure encourages an environment where our developers can bring their ideas straight to senior level partners and firm founders. We're proud to employ some of the leading talent in the industry, and we work to ensure our employees enjoy a high quality-of-life.What We Offer: A selection of healthcare plans for you and your family, some 100% employer paid; with coverage starting on day oneIn-office perks – Free lunch daily and access to a fully stocked pantry (when working in the office).Casual dress code (when working in the office).Unsolicited resumesWe do not accept unsolicited headhunter and agency resumes and will not pay fees to any third-party agency or company that does not have a signed agreement with GTS.*Salary*We do not post or share salary ranges externally, any online salary estimates may not be accurate.Location: 545 Madison Avenue,15th FL, New York, NY 10022Job Type: Full-time",
        "title": "Junior Python Developer",
        "url": "https://www.indeed.com/viewjob?jk=71acc67a281f6038"
    },
    {
        "companyLocation": "+1 locationRemote",
        "companyName": "Ocelot",
        "details": "Software Developer NodeJS/TypeScriptOcelot is hiring skilled NodeJS/TypeScript developers to help with the development of current projects. You will work on developing new features in a cloud hosted microservices architecture using state of the art development tools and technologies. You will be part of a self organizing team and experience modern agile development processes. And you will be part of a fully remote team enjoying the flexibility to work from the convenience of your home.Your duties will primarily revolve around building software by writing code, as well as modifying software to fix errors, improve its performance, or upgrade interfaces. You will also be involved in directing system testing and validation procedures, software deployment and automation of operational processes.To be successful in this role, you will need extensive knowledge of programming languages, software technologies and the software development life-cycle. A bachelor's degree in computer science, a related degree or equivalent experience is required.What you will do:Primarily you’ll design and implement new features on Ocelot’s industry leading AI Student Engagement Platform.Your technical challenges will include building scalable and reliable life-chats, engagement campaigns and AI driven chatbot technology, and the administrative and operational systems supporting them.You will work primarily on the backend services, but also occasionally on the frontend.You’ll be a member of a self-directed scrum team and enjoy driving features from inception to production.You’ll research and assess new technologies and bring the best into the Ocelot technology stack.With your team, you’ll take ownership of designing, implementing and testing the software you create.You will continuously drive improvements in the CI/CD pipeline and the automation of operations.What you need to land the job:Bachelor's degree in computer science, related degree or equivalent experience.Knowledge of the agile software development life-cycle.The desire to work in a fast-paced environment.Creativity is always a plus.Must be a full-stack developer and understand concepts of software engineering.Experience working on a variety of software development projects.Deep programming language knowledge.Hands-on experience with: NodeJS, TypeScript, JavaScript, relational and nonrelational databases, REST or GraphQLFor bonus points: NestJS, React, HTML/CSS, Python, MongoDB, MySQL/MariaDB, Docker, AWS, Kafka, ElasticSearch, Drupal, Cypress, Microservices architecture.Job Type: Full-timePay: $115,000.00 - $165,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:As a fully remote team, COVID-19 isn't a big topic for us. Employees can work from the environment they prefer and trust.Education:Bachelor's (Preferred)Experience:AWS: 1 year (Preferred)Node.js: 2 years (Required)TypeScript: 1 year (Required)Databases (relational/non-relational): 2 years (Required)REST API or GraphQL: 2 years (Required)Docker: 2 years (Preferred)Microservices: 2 years (Preferred)Work Location: Remote",
        "title": "NodeJS Developer (Backend Services)",
        "url": "https://www.indeed.com/viewjob?jk=d7cfd524eacf31c8"
    },
    {
        "companyLocation": "Remote",
        "companyName": "DevCool Inc.",
        "details": "We are looking for a Python Developer to join our delivery team and help us develop and maintain various software products. Python Developer responsibilities include writing and testing production-level codes.Required Skills: 4+ years of experience in Python Development4+ years of experience in Flask & SQL DatabaseRequired strong Python Debugging Skills.Knowledge in Linux AdministrationWork experience in Docker Development.Work experience in RestAPI's and knowledge of Neo4j(GraphDB).Strong knowledge of Advanced Object-Oriented Programming, Design Patterns, XML-RPC/REST/SOAP/ Web Services, Backend/External System Integration and experience with industry frameworks.Should be able to work independently and within a teamDesign and implement test frameworks and tools with Python.Knowledge of EDI files.Understanding of good design principles and ability to adhere to complex design specifications during implementation.Good communication skills.Job Types: Full-time, ContractSchedule:Monday to FridayEducation:Bachelor's (Preferred)Experience:Python: 3 years (Preferred)EDI: 3 years (Preferred)Work Location: Remote",
        "title": "Python Developer(Remote)",
        "url": "https://www.indeed.com/viewjob?jk=9a77e655791b08aa"
    },
    {
        "companyLocation": "New York, NY+1 location•Remote",
        "companyName": "Infinizi IT Solutions Pvt. Ltd.",
        "details": "We are looking for a Python Developer to join our engineering team and help us develop and maintain various software products. Python Developer responsibilities include writing and testing code, debugging programs and integrating applications with third-party web services. To be successful in this role, you should have experience using server-side logic and work well in a team. Ultimately, you’ll build highly responsive web applications that align with our business needs.ResponsibilitiesWrite effective, scalable codeDevelop back-end components to improve responsiveness and overall performanceIntegrate user-facing elements into applicationsTest and debug programsImprove functionality of existing systemsImplement security and data protection solutionsAssess and prioritize feature requestsCoordinate with internal teams to understand user requirements and provide technical solutionsSkillsWork experience as a Python DeveloperExpertise in at least one popular Python framework (like Django, Flask or Pyramid)Knowledge of object-relational mapping (ORM)Familiarity with front-end technologies (like JavaScript and HTML5)Team spiritGood problem-solving skillsBSc in Computer Science, Engineering or relevant fieldJob Type: Full-timePay: $94,000.00 - $167,626.00 per yearBenefits:Flexible scheduleHealth insurancePaid time offParental leaveRetirement planSchedule:Monday to FridaySupplemental Pay:Bonus paySigning bonusCOVID-19 considerations:Due to Covid-19, all our employees are currently working from home.Ability to commute/relocate:New York, NY: Reliably commute or planning to relocate before starting work (Preferred)Education:Bachelor's (Preferred)Experience:REST: 1 year (Preferred)Java: 1 year (Preferred)Work Remotely:Yes",
        "title": "Python Developer",
        "url": "https://www.indeed.com/viewjob?jk=a755cc4ff22d9af9"
    },
    {
        "companyLocation": "+1 locationRemote",
        "companyName": "Apex Consulting Services",
        "details": "Job descriptionExperience in Coding using Java, C++, or Python.Strong fundamentals in Core java and data structuresKnowledge in front end technologies like HTML, CSS, BootstrapKnowledge with databases like MySql, Oracle.Experience with unit testing, release procedures, and coding design.Experience with Frameworks like Spring, Hibernate, and rest will be plusAbility to create manual test cases.Familiar with Eclipse, Tomcat, and version control tools like SVN or GITFlexible team player and should have the desire to learn and grow.Ability to manage tasks independently and take ownership of responsibilities.Excellent communication skills and ability to adapt to a rapidly changing environment.Perform bug fixes of various modules applications that were raised by the testing team.Involve in debugging the defects, code review, and analysis of Performance issues.Use Splunk for performance monitoring and system exceptions.Job Requirements:B.S or M.S in Computer Science, Engineering, Business, or related field.Visa eligibilities : OPT,CPT, H1B,F1,EAD(GC/H4/L2)Job Type: Full-timePay: $48,719.00 - $116,872.00 per yearSchedule:8 hour shiftEducation:Bachelor's (Preferred)Experience:REST: 1 year (Preferred)Java: 1 year (Preferred)",
        "title": "Jr. Java Developer",
        "url": "https://www.indeed.com/viewjob?jk=b52036d6feecf352"
    },
    {
        "companyLocation": "+1 locationRemote",
        "companyName": "Maxisit",
        "details": "Bachelor's or master's degree in Computer Science, or related area1-3 years of professional experience with Linux operating systems3-5 years of professional experience with Python as a primary language (non-scripting)Understanding of databases and SQLHigh attention to detailJob Types: Full-time, ContractPay: $70.00 - $80.00 per hourSchedule:8 hour shiftEducation:Bachelor's (Preferred)Experience:REST: 1 year (Preferred)Java: 1 year (Preferred)Work Location: Remote",
        "title": "Python developer - REMOTE ROLE",
        "url": "https://www.indeed.com/viewjob?jk=b6ba473709fa42f5"
    },
    {
        "companyLocation": "New York, NY+1 location",
        "companyName": "Underdog.io",
        "details": "We're looking for a Full Stack Developer to join a company in the Underdog.io network.The Underdog.io network is a curated group of some of the fastest growing startups and tech companies in the country. We actively turn away more than 50% of companies that attempt to join.We accept companies that offer competitive salaries, benefits, and perks. They're working on interesting technical challenges and must be respectful of your time to stay active.Our companies look for Full Stack Developers proficient in Python, Javascript, CSS, HTML, Node.js and more. The ideal candidate is motivated by working on complex technical problems and curious about the world around them. Many of our companies are looking for mid-to-senior level talent, both individual contributors and managers.To apply to the network, we'll ask you to fill out a 60-second web form. It's absolutely free.If accepted, you'll hear directly from founders, hiring managers, and other key decision makers starting the following Monday. Our platform will hide your profile from your current employer.Apply today!Building an inclusive and diverse workplace is one of Underdog.io’s core values. We warmly welcome people of all backgrounds, experiences, and perspectives.Job Type: Full-timePay: $102,000.00 - $182,000.00 per yearSchedule:8 hour shiftWork Location:One locationWork Remotely:No",
        "title": "Full Stack Developer",
        "url": "https://www.indeed.com/viewjob?jk=2df0564df7756395"
    },
    {
        "companyLocation": "Remote",
        "companyName": "Gridiron IT",
        "details": "Job DescriptionThe Controlled Data Access (CDA) team is responsible for developing and maintaining state of the art digital token technologies to manage users and access to the clients databasesThe Senior Software Developer will work with the team to develop and maintain software supporting clients Controlled Data Access technologies including the Authorized Access platform and Study Registration System. Internal implementation of the Researcher Auth Service (RAS Clearinghouse), and the Data Repository Service (DRS).The CDA team employs several technologies such as: SQL, C++, C#, Python, Java, JSON, JWT, JWS, YAML, OpenAPI, XML, XSL, HTML, CSS, and JavaScript. Our development environment is currently comprised of: Microsoft SQL Server, Linux, .Net, gmake, with git for source control, TeamCity/Jenkins for CI/CD.Required SkillsBachelor’s degree in Computer Science or relevant experienceFluency in scripting languages such as BASH, or PythonProgramming experience in a Linux environment.Ability to work with JSON, XML and similar structured document formatsDesired SkillsKnowledge of Cloud technologiesObject-oriented programmingKnowledge of HTML, CGI and REST APIsFamiliarity with Agile development practicesFamiliarity with unit tests, integration, and regression testingJob ResponsibilitiesLearn new technologies and changes to the infrastructureLearn to develop secure software using token-based securityDevelop, Test, and Deploy solutions for the product lineMaintain and develop code in support of the product lineEstimate, plan, and manage all assigned tasks and report on progressDocument software and systems to meet product and program requirementsJob Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceHealth insurancePaid time offTuition reimbursementVision insuranceSchedule:8 hour shiftMonday to FridayApplication Question(s):Due to the nature of this position, it requires US Citizenship or a Green Card. Are you a US Citizen or Green Card Holder?Education:Bachelor's (Preferred)Experience:Python: 3 years (Preferred)HTML: 3 years (Preferred)REST APIs: 3 years (Preferred)SQL: 1 year (Preferred)Linux: 4 years (Preferred)C++: 3 years (Preferred)Work Location: Remote",
        "title": "newSoftware Developer",
        "url": "https://www.indeed.com/viewjob?jk=452069ed6f681031"
    }
]